{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/ayumis/Dropbox/Democracy/MainAnalysis/code/2_analyze/tables/main/logs/table3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Sep 2021, 18:46:23

{com}. do "/var/folders/f1/rfzhvqh92gggg8dnlpw60sm80000gn/T//SD10141.000000"
{txt}
{com}. ********************************************************************************
. * Table 3: 2SLS Regression Estimates of Democracy's Effects on Mechanisms
. ********************************************************************************
. clear 
{txt}
{com}. 
. *** Change to appropriate directory
. cd ${c -(}path_dropbox{c )-}/tables
{res}/Users/ayumis/Dropbox/アプリ/Overleaf/Curse_of_Democracy/supporting_files/tables
{txt}
{com}. 
. *** Load data 
. use ${c -(}path_data{c )-}/total.dta, replace
{txt}
{com}. 
. ********************************************************************************
. * Dependent Variable: Value Added, Agriculture (Annual % Growth) * 
. 
. // Panel A, column 1
. reg mean_agr_va_growth_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,329.441)

Linear regression                               Number of obs     = {res}       162
                                                {txt}F(1, 160)         =  {res}    13.72
                                                {txt}Prob > F          = {res}    0.0003
                                                {txt}R-squared         = {res}    0.1683
                                                {txt}Root MSE          =    {res} 1.5587

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_agr_va_g~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.9138241{col 32}{space 2} .2466771{col 43}{space 1}   -3.70{col 52}{space 3}0.000{col 60}{space 4}-1.400987{col 73}{space 3}-.4266612
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 2.130861{col 32}{space 2}  .363997{col 43}{space 1}    5.85{col 52}{space 3}0.000{col 60}{space 4} 1.412002{col 73}{space 3} 2.849719
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 2
. reg mean_agr_va_growth_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,329.441)

Linear regression                               Number of obs     = {res}       162
                                                {txt}F(6, 155)         =  {res}    10.76
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.7301
                                                {txt}Root MSE          =    {res} .90209

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_agr_va_grow~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} .1660066{col 35}{space 2} .3060449{col 46}{space 1}    0.54{col 55}{space 3}0.588{col 63}{space 4}-.4385505{col 76}{space 3} .7705637
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0088145{col 35}{space 2} .0187694{col 46}{space 1}    0.47{col 55}{space 3}0.639{col 63}{space 4}-.0282622{col 76}{space 3} .0458913
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0979516{col 35}{space 2} .0270193{col 46}{space 1}   -3.63{col 55}{space 3}0.000{col 63}{space 4}-.1513251{col 76}{space 3}-.0445781
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0066997{col 35}{space 2} .0044093{col 46}{space 1}   -1.52{col 55}{space 3}0.131{col 63}{space 4}-.0154098{col 76}{space 3} .0020104
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0000593{col 35}{space 2} .0003942{col 46}{space 1}   -0.15{col 55}{space 3}0.881{col 63}{space 4} -.000838{col 76}{space 3} .0007193
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.2952868{col 35}{space 2} .0582909{col 46}{space 1}   -5.07{col 55}{space 3}0.000{col 63}{space 4}-.4104339{col 76}{space 3}-.1801397
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 12.63709{col 35}{space 2} 1.608142{col 46}{space 1}    7.86{col 55}{space 3}0.000{col 63}{space 4} 9.460385{col 76}{space 3} 15.81379
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 1
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  1,    75) = {res}   11.21
{txt}{col 55}Prob > F      = {res}  0.0013
{txt}Total (centered) SS     = {res}  64.0366011{txt}{col 55}Centered R2   = {res}  0.1280
{txt}Total (uncentered) SS   = {res} 463.6652656{txt}{col 55}Uncentered R2 = {res}  0.8796
{txt}Residual SS             = {res} 55.84037111{txt}{col 55}Root MSE      = {res}   .8516

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_agr_va_g~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.185562{col 32}{space 2} .3494683{col 43}{space 1}   -3.39{col 52}{space 3}0.001{col 60}{space 4}-1.870507{col 73}{space 3}-.5006164
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 3.345293{col 32}{space 2} .4363269{col 43}{space 1}    7.67{col 52}{space 3}0.000{col 60}{space 4} 2.490108{col 73}{space 3} 4.200478
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.041
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0812
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   9.907
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 2
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  7,    69) = {res}    1.14
{txt}{col 55}Prob > F      = {res}  0.3461
{txt}Total (centered) SS     = {res}  64.0366011{txt}{col 55}Centered R2   = {res} -4.5777
{txt}Total (uncentered) SS   = {res} 463.6652656{txt}{col 55}Uncentered R2 = {res}  0.2297
{txt}Residual SS             = {res} 357.1773901{txt}{col 55}Root MSE      = {res}   2.154

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_agr_va_grow~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-4.794181{col 35}{space 2} 6.589382{col 46}{space 1}   -0.73{col 55}{space 3}0.467{col 63}{space 4}-17.70913{col 76}{space 3} 8.120771
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} .0001999{col 35}{space 2} .0003312{col 46}{space 1}    0.60{col 55}{space 3}0.546{col 63}{space 4}-.0004493{col 76}{space 3} .0008491
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .3950439{col 35}{space 2} .6151195{col 46}{space 1}    0.64{col 55}{space 3}0.521{col 63}{space 4}-.8105682{col 76}{space 3} 1.600656
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .5977168{col 35}{space 2} .9718038{col 46}{space 1}    0.62{col 55}{space 3}0.539{col 63}{space 4}-1.306984{col 76}{space 3} 2.502417
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0444447{col 35}{space 2} .0593204{col 46}{space 1}    0.75{col 55}{space 3}0.454{col 63}{space 4}-.0718212{col 76}{space 3} .1607105
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} -.002368{col 35}{space 2} .0028339{col 46}{space 1}   -0.84{col 55}{space 3}0.403{col 63}{space 4}-.0079223{col 76}{space 3} .0031864
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .0250843{col 35}{space 2} .2283954{col 46}{space 1}    0.11{col 55}{space 3}0.913{col 63}{space 4}-.4225624{col 76}{space 3}  .472731
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-21.70671{col 35}{space 2} 40.90008{col 46}{space 1}   -0.53{col 55}{space 3}0.596{col 63}{space 4}-101.8694{col 76}{space 3} 58.45596
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.565
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.4522
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.479
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 1
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6652e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      88
{txt}{col 55}F(  1,    86) = {res}   25.61
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 73.73686612{txt}{col 55}Centered R2   = {res}  0.3349
{txt}Total (uncentered) SS   = {res} 530.9146813{txt}{col 55}Uncentered R2 = {res}  0.9076
{txt}Residual SS             = {res} 49.04146168{txt}{col 55}Root MSE      = {res}   .7465

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_agr_va_g~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.8378505{col 32}{space 2} .1636767{col 43}{space 1}   -5.12{col 52}{space 3}0.000{col 60}{space 4}-1.158651{col 73}{space 3}  -.51705
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 3.028094{col 32}{space 2} .1963271{col 43}{space 1}   15.42{col 52}{space 3}0.000{col 60}{space 4}   2.6433{col 73}{space 3} 3.412888
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.404
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0650
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  13.488
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 2
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6652e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      88
{txt}{col 55}F(  7,    80) = {res}  122.40
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 73.73686612{txt}{col 55}Centered R2   = {res}  0.5907
{txt}Total (uncentered) SS   = {res} 530.9146813{txt}{col 55}Uncentered R2 = {res}  0.9431
{txt}Residual SS             = {res} 30.18271991{txt}{col 55}Root MSE      = {res}   .5856

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_agr_va_grow~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.3103986{col 35}{space 2} .3232971{col 46}{space 1}   -0.96{col 55}{space 3}0.337{col 63}{space 4}-.9440493{col 76}{space 3} .3232521
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000306{col 35}{space 2} .0000212{col 46}{space 1}   -1.44{col 55}{space 3}0.149{col 63}{space 4}-.0000722{col 76}{space 3}  .000011
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0240334{col 35}{space 2} .0434667{col 46}{space 1}   -0.55{col 55}{space 3}0.580{col 63}{space 4}-.1092265{col 76}{space 3} .0611598
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0566487{col 35}{space 2} .0586684{col 46}{space 1}   -0.97{col 55}{space 3}0.334{col 63}{space 4}-.1716366{col 76}{space 3} .0583392
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0005863{col 35}{space 2}  .004047{col 46}{space 1}    0.14{col 55}{space 3}0.885{col 63}{space 4}-.0073457{col 76}{space 3} .0085184
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0004379{col 35}{space 2} .0001153{col 46}{space 1}   -3.80{col 55}{space 3}0.000{col 63}{space 4}-.0006639{col 76}{space 3}-.0002119
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0260901{col 35}{space 2} .0539026{col 46}{space 1}   -0.48{col 55}{space 3}0.628{col 63}{space 4}-.1317371{col 76}{space 3}  .079557
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 5.575019{col 35}{space 2} 2.816648{col 46}{space 1}    1.98{col 55}{space 3}0.048{col 63}{space 4} .0544901{col 76}{space 3} 11.09555
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.982
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0145
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  12.057
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 1
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6660e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      92
{txt}{col 55}F(  1,    90) = {res}    9.17
{txt}{col 55}Prob > F      = {res}  0.0032
{txt}Total (centered) SS     = {res} 77.22523717{txt}{col 55}Centered R2   = {res}  0.2350
{txt}Total (uncentered) SS   = {res}  555.110232{txt}{col 55}Uncentered R2 = {res}  0.8936
{txt}Residual SS             = {res} 59.07932903{txt}{col 55}Root MSE      = {res}   .8014

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_agr_va_g~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.033732{col 32}{space 2} .3376399{col 43}{space 1}   -3.06{col 52}{space 3}0.002{col 60}{space 4}-1.695495{col 73}{space 3}-.3719703
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 3.202716{col 32}{space 2} .4017286{col 43}{space 1}    7.97{col 52}{space 3}0.000{col 60}{space 4} 2.415342{col 73}{space 3}  3.99009
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.481
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1152
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   5.889
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 2
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6660e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      92
{txt}{col 55}F(  7,    84) = {res}    6.07
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 77.22523717{txt}{col 55}Centered R2   = {res}  0.2774
{txt}Total (uncentered) SS   = {res}  555.110232{txt}{col 55}Uncentered R2 = {res}  0.8995
{txt}Residual SS             = {res} 55.80268846{txt}{col 55}Root MSE      = {res}   .7788

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_agr_va_grow~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 1.119407{col 35}{space 2} 11.42192{col 46}{space 1}    0.10{col 55}{space 3}0.922{col 63}{space 4}-21.26715{col 76}{space 3} 23.50596
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0001024{col 35}{space 2} .0005734{col 46}{space 1}   -0.18{col 55}{space 3}0.858{col 63}{space 4}-.0012263{col 76}{space 3} .0010215
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.1533977{col 35}{space 2} 1.028819{col 46}{space 1}   -0.15{col 55}{space 3}0.881{col 63}{space 4}-2.169847{col 76}{space 3} 1.863051
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.2638024{col 35}{space 2} 1.657658{col 46}{space 1}   -0.16{col 55}{space 3}0.874{col 63}{space 4}-3.512753{col 76}{space 3} 2.985148
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0126316{col 35}{space 2} .1034965{col 46}{space 1}   -0.12{col 55}{space 3}0.903{col 63}{space 4} -.215481{col 76}{space 3} .1902178
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0001829{col 35}{space 2} .0049603{col 46}{space 1}    0.04{col 55}{space 3}0.971{col 63}{space 4}-.0095391{col 76}{space 3}  .009905
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0529546{col 35}{space 2} .2228842{col 46}{space 1}   -0.24{col 55}{space 3}0.812{col 63}{space 4}-.4897996{col 76}{space 3} .3838903
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 14.36497{col 35}{space 2} 69.90053{col 46}{space 1}    0.21{col 55}{space 3}0.837{col 63}{space 4}-122.6376{col 76}{space 3} 151.3675
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.023
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8799
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.021
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 1
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3073e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     135
{txt}{col 55}F(  1,   133) = {res}    0.50
{txt}{col 55}Prob > F      = {res}  0.4825
{txt}Total (centered) SS     = {res} 381.7036926{txt}{col 55}Centered R2   = {res} -0.9832
{txt}Total (uncentered) SS   = {res} 579.8578759{txt}{col 55}Uncentered R2 = {res} -0.3055
{txt}Residual SS             = {res} 756.9859161{txt}{col 55}Root MSE      = {res}   2.368

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_agr_va_g~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} 1.484283{col 32}{space 2} 2.091811{col 43}{space 1}    0.71{col 52}{space 3}0.478{col 60}{space 4} -2.61559{col 73}{space 3} 5.584157
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-.2678094{col 32}{space 2} 2.641467{col 43}{space 1}   -0.10{col 52}{space 3}0.919{col 60}{space 4}-5.444989{col 73}{space 3}  4.90937
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.099
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0781
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.877
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.199
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.6557
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 2
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3047e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     134
{txt}{col 55}F(  7,   126) = {res}   17.80
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 379.0020631{txt}{col 55}Centered R2   = {res}  0.6538
{txt}Total (uncentered) SS   = {res} 575.3646023{txt}{col 55}Uncentered R2 = {res}  0.7719
{txt}Residual SS             = {res}  131.223388{txt}{col 55}Root MSE      = {res}   .9896

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_agr_va_grow~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 1.359278{col 35}{space 2} .4518455{col 46}{space 1}    3.01{col 55}{space 3}0.003{col 63}{space 4} .4736775{col 76}{space 3} 2.244879
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000563{col 35}{space 2} .0000222{col 46}{space 1}   -2.53{col 55}{space 3}0.011{col 63}{space 4}-.0000999{col 76}{space 3}-.0000127
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0354749{col 35}{space 2} .0309833{col 46}{space 1}   -1.14{col 55}{space 3}0.252{col 63}{space 4} -.096201{col 76}{space 3} .0252512
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.1627541{col 35}{space 2} .0556873{col 46}{space 1}   -2.92{col 55}{space 3}0.003{col 63}{space 4}-.2718992{col 76}{space 3}-.0536091
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0107499{col 35}{space 2} .0039037{col 46}{space 1}   -2.75{col 55}{space 3}0.006{col 63}{space 4} -.018401{col 76}{space 3}-.0030987
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0003742{col 35}{space 2} .0002979{col 46}{space 1}    1.26{col 55}{space 3}0.209{col 63}{space 4}-.0002097{col 76}{space 3} .0009581
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} -.280848{col 35}{space 2} .0589629{col 46}{space 1}   -4.76{col 55}{space 3}0.000{col 63}{space 4}-.3964131{col 76}{space 3}-.1652828
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 15.03226{col 35}{space 2} 1.588962{col 46}{space 1}    9.46{col 55}{space 3}0.000{col 63}{space 4} 11.91795{col 76}{space 3} 18.14657
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   7.757
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0207
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.560
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   3.639
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0564
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 1 
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3121e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     140
{txt}{col 55}F(  1,   138) = {res}    7.27
{txt}{col 55}Prob > F      = {res}  0.0079
{txt}Total (centered) SS     = {res} 396.0755245{txt}{col 55}Centered R2   = {res}  0.1233
{txt}Total (uncentered) SS   = {res} 602.6449408{txt}{col 55}Uncentered R2 = {res}  0.4238
{txt}Residual SS             = {res}  347.247373{txt}{col 55}Root MSE      = {res}   1.575

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_agr_va_g~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.369556{col 32}{space 2} .5044633{col 43}{space 1}   -2.71{col 52}{space 3}0.007{col 60}{space 4}-2.358286{col 73}{space 3}-.3808267
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 2.574566{col 32}{space 2} .4441245{col 43}{space 1}    5.80{col 52}{space 3}0.000{col 60}{space 4} 1.704098{col 73}{space 3} 3.445034
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  19.274
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.0369
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   4.405
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   8.721
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.4634
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 2
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3095e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     139
{txt}{col 55}F(  7,   131) = {res}   12.76
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 393.3777854{txt}{col 55}Centered R2   = {res}  0.7613
{txt}Total (uncentered) SS   = {res} 598.1362261{txt}{col 55}Uncentered R2 = {res}  0.8430
{txt}Residual SS             = {res} 93.89594965{txt}{col 55}Root MSE      = {res}   .8219

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_agr_va_grow~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} .3009442{col 35}{space 2} .4640241{col 46}{space 1}    0.65{col 55}{space 3}0.517{col 63}{space 4}-.6085264{col 76}{space 3} 1.210415
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000281{col 35}{space 2} .0000178{col 46}{space 1}   -1.58{col 55}{space 3}0.115{col 63}{space 4}-.0000629{col 76}{space 3} 6.80e-06
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0117113{col 35}{space 2} .0233406{col 46}{space 1}   -0.50{col 55}{space 3}0.616{col 63}{space 4}-.0574581{col 76}{space 3} .0340356
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.1235404{col 35}{space 2} .0369429{col 46}{space 1}   -3.34{col 55}{space 3}0.001{col 63}{space 4}-.1959472{col 76}{space 3}-.0511337
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0078307{col 35}{space 2} .0047066{col 46}{space 1}   -1.66{col 55}{space 3}0.096{col 63}{space 4}-.0170555{col 76}{space 3}  .001394
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0000657{col 35}{space 2} .0004284{col 46}{space 1}   -0.15{col 55}{space 3}0.878{col 63}{space 4}-.0009054{col 76}{space 3}  .000774
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.2497944{col 35}{space 2} .0519201{col 46}{space 1}   -4.81{col 55}{space 3}0.000{col 63}{space 4} -.351556{col 76}{space 3}-.1480329
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}  12.7801{col 35}{space 2} 1.957105{col 46}{space 1}    6.53{col 55}{space 3}0.000{col 63}{space 4} 8.944246{col 76}{space 3} 16.61596
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.716
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.3801
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.752
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  14.384
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.1093
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 1 
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  1,    71) = {res}   50.53
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 60.60484009{txt}{col 55}Centered R2   = {res}  0.3715
{txt}Total (uncentered) SS   = {res}  438.822204{txt}{col 55}Uncentered R2 = {res}  0.9132
{txt}Residual SS             = {res} 38.08900305{txt}{col 55}Root MSE      = {res}   .7223

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_agr_va_g~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.7417512{col 32}{space 2} .1029087{col 43}{space 1}   -7.21{col 52}{space 3}0.000{col 60}{space 4}-.9434485{col 73}{space 3} -.540054
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 2.947982{col 32}{space 2} .1348323{col 43}{space 1}   21.86{col 52}{space 3}0.000{col 60}{space 4} 2.683716{col 73}{space 3} 3.212249
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  21.884
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.1109
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  84.236
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  12.935
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.5316
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 2
. ivreg2 mean_agr_va_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  7,    65) = {res}   78.66
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 60.60484009{txt}{col 55}Centered R2   = {res}  0.6242
{txt}Total (uncentered) SS   = {res}  438.822204{txt}{col 55}Uncentered R2 = {res}  0.9481
{txt}Residual SS             = {res} 22.77528995{txt}{col 55}Root MSE      = {res}   .5586

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_agr_va_grow~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.0704455{col 35}{space 2} .2085752{col 46}{space 1}   -0.34{col 55}{space 3}0.736{col 63}{space 4}-.4792453{col 76}{space 3} .3383543
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000409{col 35}{space 2} .0000135{col 46}{space 1}   -3.04{col 55}{space 3}0.002{col 63}{space 4}-.0000673{col 76}{space 3}-.0000145
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0463195{col 35}{space 2}  .032853{col 46}{space 1}   -1.41{col 55}{space 3}0.159{col 63}{space 4}-.1107103{col 76}{space 3} .0180712
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0945166{col 35}{space 2} .0429038{col 46}{space 1}   -2.20{col 55}{space 3}0.028{col 63}{space 4}-.1786064{col 76}{space 3}-.0104267
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0017534{col 35}{space 2} .0038822{col 46}{space 1}   -0.45{col 55}{space 3}0.652{col 63}{space 4}-.0093625{col 76}{space 3} .0058557
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0003223{col 35}{space 2}  .000123{col 46}{space 1}   -2.62{col 55}{space 3}0.009{col 63}{space 4}-.0005634{col 76}{space 3}-.0000813
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0414939{col 35}{space 2} .0547874{col 46}{space 1}   -0.76{col 55}{space 3}0.449{col 63}{space 4}-.1488752{col 76}{space 3} .0658873
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 7.422345{col 35}{space 2} 2.564595{col 46}{space 1}    2.89{col 55}{space 3}0.004{col 63}{space 4} 2.395831{col 76}{space 3} 12.44886
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  15.411
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.4222
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.207
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  25.574
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.0293
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. ********************************************************************************
. * Dependent Variable: Value Added, Manufacturing (Annual % Growth) * 
. 
. // Panel A, column 3
. reg mean_manu_va_growth_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 32,124.342)

Linear regression                               Number of obs     = {res}       162
                                                {txt}F(1, 160)         =  {res}    60.61
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2392
                                                {txt}Root MSE          =    {res} 1.4602

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_manu_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.368871{col 32}{space 2}  .175822{col 43}{space 1}   -7.79{col 52}{space 3}0.000{col 60}{space 4}-1.716102{col 73}{space 3} -1.02164
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 3.211672{col 32}{space 2} .2571572{col 43}{space 1}   12.49{col 52}{space 3}0.000{col 60}{space 4} 2.703812{col 73}{space 3} 3.719532
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 4
. reg mean_manu_va_growth_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 32,124.342)

Linear regression                               Number of obs     = {res}       162
                                                {txt}F(6, 155)         =  {res}    12.48
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.3119
                                                {txt}Root MSE          =    {res}  1.411

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_manu_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.8356315{col 35}{space 2} .3477328{col 46}{space 1}   -2.40{col 55}{space 3}0.017{col 63}{space 4}-1.522538{col 76}{space 3}-.1487246
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0030531{col 35}{space 2} .0394739{col 46}{space 1}    0.08{col 55}{space 3}0.938{col 63}{space 4}-.0749232{col 76}{space 3} .0810294
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0401235{col 35}{space 2} .0521542{col 46}{space 1}   -0.77{col 55}{space 3}0.443{col 63}{space 4}-.1431482{col 76}{space 3} .0629013
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}  .004173{col 35}{space 2} .0058603{col 46}{space 1}    0.71{col 55}{space 3}0.477{col 63}{space 4}-.0074033{col 76}{space 3} .0157494
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0008742{col 35}{space 2} .0006122{col 46}{space 1}    1.43{col 55}{space 3}0.155{col 63}{space 4}-.0003352{col 76}{space 3} .0020837
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.1172595{col 35}{space 2} .0696714{col 46}{space 1}   -1.68{col 55}{space 3}0.094{col 63}{space 4}-.2548875{col 76}{space 3} .0203684
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}  6.60244{col 35}{space 2} 1.950176{col 46}{space 1}    3.39{col 55}{space 3}0.001{col 63}{space 4} 2.750087{col 76}{space 3} 10.45479
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 3
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5323e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      76
{txt}{col 55}F(  1,    74) = {res}    5.22
{txt}{col 55}Prob > F      = {res}  0.0252
{txt}Total (centered) SS     = {res} 221.8586796{txt}{col 55}Centered R2   = {res}  0.1966
{txt}Total (uncentered) SS   = {res} 450.1406246{txt}{col 55}Uncentered R2 = {res}  0.6040
{txt}Residual SS             = {res}  178.233884{txt}{col 55}Root MSE      = {res}   1.531

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_manu_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.755198{col 32}{space 2}  .757827{col 43}{space 1}   -2.32{col 52}{space 3}0.021{col 60}{space 4}-3.240512{col 73}{space 3}-.2698849
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 3.650592{col 32}{space 2} .9881595{col 43}{space 1}    3.69{col 52}{space 3}0.000{col 60}{space 4} 1.713835{col 73}{space 3} 5.587349
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.802
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0010
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  25.829
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 4
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5323e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      76
{txt}{col 55}F(  7,    68) = {res}    2.45
{txt}{col 55}Prob > F      = {res}  0.0266
{txt}Total (centered) SS     = {res} 221.8586796{txt}{col 55}Centered R2   = {res}  0.1696
{txt}Total (uncentered) SS   = {res} 450.1406246{txt}{col 55}Uncentered R2 = {res}  0.5907
{txt}Residual SS             = {res} 184.2298985{txt}{col 55}Root MSE      = {res}   1.557

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_manu_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-2.430589{col 35}{space 2} 4.736409{col 46}{space 1}   -0.51{col 55}{space 3}0.608{col 63}{space 4}-11.71378{col 76}{space 3} 6.852603
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} .0000677{col 35}{space 2}  .000068{col 46}{space 1}    1.00{col 55}{space 3}0.320{col 63}{space 4}-.0000656{col 76}{space 3} .0002011
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}  .112861{col 35}{space 2} .0826352{col 46}{space 1}    1.37{col 55}{space 3}0.172{col 63}{space 4} -.049101{col 76}{space 3} .2748231
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .1626522{col 35}{space 2} .1542874{col 46}{space 1}    1.05{col 55}{space 3}0.292{col 63}{space 4}-.1397455{col 76}{space 3}   .46505
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0126068{col 35}{space 2} .0089315{col 46}{space 1}    1.41{col 55}{space 3}0.158{col 63}{space 4}-.0048987{col 76}{space 3} .0301123
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0000569{col 35}{space 2} .0017689{col 46}{space 1}    0.03{col 55}{space 3}0.974{col 63}{space 4}-.0034102{col 76}{space 3} .0035239
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0645077{col 35}{space 2} .5879852{col 46}{space 1}   -0.11{col 55}{space 3}0.913{col 63}{space 4}-1.216938{col 76}{space 3} 1.087922
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-1.801441{col 35}{space 2} 13.34374{col 46}{space 1}   -0.14{col 55}{space 3}0.893{col 63}{space 4}-27.95469{col 76}{space 3} 24.35181
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.365
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.5459
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.333
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 3
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5446e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      87
{txt}{col 55}F(  1,    85) = {res}    4.83
{txt}{col 55}Prob > F      = {res}  0.0307
{txt}Total (centered) SS     = {res} 258.0800793{txt}{col 55}Centered R2   = {res}  0.0539
{txt}Total (uncentered) SS   = {res} 525.8989463{txt}{col 55}Uncentered R2 = {res}  0.5357
{txt}Residual SS             = {res} 244.1664299{txt}{col 55}Root MSE      = {res}   1.675

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_manu_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} -2.73877{col 32}{space 2} 1.232029{col 43}{space 1}   -2.22{col 52}{space 3}0.026{col 60}{space 4}-5.153503{col 73}{space 3}-.3240368
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 4.723386{col 32}{space 2} 1.487791{col 43}{space 1}    3.17{col 52}{space 3}0.001{col 60}{space 4} 1.807369{col 73}{space 3} 7.639403
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  13.563
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0002
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  17.722
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 4
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5446e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      87
{txt}{col 55}F(  7,    79) = {res}    0.72
{txt}{col 55}Prob > F      = {res}  0.6565
{txt}Total (centered) SS     = {res} 258.0800793{txt}{col 55}Centered R2   = {res} -2.1417
{txt}Total (uncentered) SS   = {res} 525.8989463{txt}{col 55}Uncentered R2 = {res} -0.5418
{txt}Residual SS             = {res} 810.8114423{txt}{col 55}Root MSE      = {res}   3.053

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_manu_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} -8.90109{col 35}{space 2} 10.13721{col 46}{space 1}   -0.88{col 55}{space 3}0.380{col 63}{space 4}-28.76965{col 76}{space 3} 10.96747
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-5.71e-06{col 35}{space 2} .0001402{col 46}{space 1}   -0.04{col 55}{space 3}0.968{col 63}{space 4}-.0002806{col 76}{space 3} .0002691
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0538114{col 35}{space 2} .1471837{col 46}{space 1}    0.37{col 55}{space 3}0.715{col 63}{space 4}-.2346633{col 76}{space 3} .3422862
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .2232046{col 35}{space 2} .3140074{col 46}{space 1}    0.71{col 55}{space 3}0.477{col 63}{space 4}-.3922386{col 76}{space 3} .8386478
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0100286{col 35}{space 2}  .019503{col 46}{space 1}    0.51{col 55}{space 3}0.607{col 63}{space 4}-.0281967{col 76}{space 3} .0482538
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0025012{col 35}{space 2} .0035997{col 46}{space 1}   -0.69{col 55}{space 3}0.487{col 63}{space 4}-.0095565{col 76}{space 3} .0045541
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .7579887{col 35}{space 2} 1.213391{col 46}{space 1}    0.62{col 55}{space 3}0.532{col 63}{space 4}-1.620214{col 76}{space 3} 3.136192
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-17.65937{col 35}{space 2} 27.90518{col 46}{space 1}   -0.63{col 55}{space 3}0.527{col 63}{space 4}-72.35251{col 76}{space 3} 37.03377
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   1.335
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.2479
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.055
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 3
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5454e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      91
{txt}{col 55}F(  1,    89) = {res}    0.04
{txt}{col 55}Prob > F      = {res}  0.8447
{txt}Total (centered) SS     = {res} 270.1738383{txt}{col 55}Centered R2   = {res}  0.0455
{txt}Total (uncentered) SS   = {res} 550.4791731{txt}{col 55}Uncentered R2 = {res}  0.5315
{txt}Residual SS             = {res} 257.8719771{txt}{col 55}Root MSE      = {res}   1.683

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_manu_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.1662648{col 32}{space 2} .8368065{col 43}{space 1}   -0.20{col 52}{space 3}0.843{col 60}{space 4}-1.806375{col 73}{space 3} 1.473846
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 1.935243{col 32}{space 2} .8849882{col 43}{space 1}    2.19{col 52}{space 3}0.029{col 60}{space 4}  .200698{col 73}{space 3} 3.669788
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.538
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0186
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.048
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 4
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5454e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      91
{txt}{col 55}F(  7,    83) = {res}    0.14
{txt}{col 55}Prob > F      = {res}  0.9947
{txt}Total (centered) SS     = {res} 270.1738383{txt}{col 55}Centered R2   = {res}-27.2254
{txt}Total (uncentered) SS   = {res} 550.4791731{txt}{col 55}Uncentered R2 = {res}-12.8530
{txt}Residual SS             = {res} 7625.771376{txt}{col 55}Root MSE      = {res}   9.154

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_manu_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-28.83643{col 35}{space 2} 95.67106{col 46}{space 1}   -0.30{col 55}{space 3}0.763{col 63}{space 4}-216.3483{col 76}{space 3} 158.6754
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0002368{col 35}{space 2} .0010974{col 46}{space 1}   -0.22{col 55}{space 3}0.829{col 63}{space 4}-.0023877{col 76}{space 3}  .001914
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.1440553{col 35}{space 2} .8526581{col 46}{space 1}   -0.17{col 55}{space 3}0.866{col 63}{space 4}-1.815234{col 76}{space 3} 1.527124
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .3894119{col 35}{space 2} 1.279906{col 46}{space 1}    0.30{col 55}{space 3}0.761{col 63}{space 4}-2.119157{col 76}{space 3} 2.897981
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-8.16e-06{col 35}{space 2} .0595233{col 46}{space 1}   -0.00{col 55}{space 3}1.000{col 63}{space 4}-.1166717{col 76}{space 3} .1166554
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0103551{col 35}{space 2}  .037367{col 46}{space 1}   -0.28{col 55}{space 3}0.782{col 63}{space 4}-.0835931{col 76}{space 3} .0628828
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 3.297603{col 35}{space 2} 12.03277{col 46}{space 1}    0.27{col 55}{space 3}0.784{col 63}{space 4} -20.2862{col 76}{space 3} 26.88141
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-65.66521{col 35}{space 2} 239.9281{col 46}{space 1}   -0.27{col 55}{space 3}0.784{col 63}{space 4}-535.9156{col 76}{space 3} 404.5851
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.106
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.7446
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.093
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 3
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.1868e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     135
{txt}{col 55}F(  1,   133) = {res}    8.73
{txt}{col 55}Prob > F      = {res}  0.0037
{txt}Total (centered) SS     = {res} 353.8911319{txt}{col 55}Centered R2   = {res} -0.0139
{txt}Total (uncentered) SS   = {res} 744.5265673{txt}{col 55}Uncentered R2 = {res}  0.5181
{txt}Residual SS             = {res} 358.8095982{txt}{col 55}Root MSE      = {res}    1.63

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_manu_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.679903{col 32}{space 2} .9003489{col 43}{space 1}   -2.98{col 52}{space 3}0.003{col 60}{space 4}-4.444555{col 73}{space 3}-.9152521
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 4.629605{col 32}{space 2} .9943448{col 43}{space 1}    4.66{col 52}{space 3}0.000{col 60}{space 4} 2.680725{col 73}{space 3} 6.578485
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.991
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0112
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   3.781
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.185
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.6670
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 4
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.1842e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     134
{txt}{col 55}F(  7,   126) = {res}    2.67
{txt}{col 55}Prob > F      = {res}  0.0130
{txt}Total (centered) SS     = {res} 349.9263134{txt}{col 55}Centered R2   = {res}  0.0461
{txt}Total (uncentered) SS   = {res} 739.1010867{txt}{col 55}Uncentered R2 = {res}  0.5484
{txt}Residual SS             = {res} 333.7863202{txt}{col 55}Root MSE      = {res}   1.578

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_manu_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-2.803385{col 35}{space 2} .9153927{col 46}{space 1}   -3.06{col 55}{space 3}0.002{col 63}{space 4}-4.597521{col 76}{space 3}-1.009248
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-5.02e-06{col 35}{space 2} .0000344{col 46}{space 1}   -0.15{col 55}{space 3}0.884{col 63}{space 4}-.0000724{col 76}{space 3} .0000623
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0172764{col 35}{space 2} .0507136{col 46}{space 1}   -0.34{col 55}{space 3}0.733{col 63}{space 4}-.1166733{col 76}{space 3} .0821204
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0861968{col 35}{space 2} .0970589{col 46}{space 1}   -0.89{col 55}{space 3}0.374{col 63}{space 4}-.2764288{col 76}{space 3} .1040351
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}  .005158{col 35}{space 2} .0059027{col 46}{space 1}    0.87{col 55}{space 3}0.382{col 63}{space 4} -.006411{col 76}{space 3}  .016727
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0002373{col 35}{space 2} .0005676{col 46}{space 1}    0.42{col 55}{space 3}0.676{col 63}{space 4}-.0008752{col 76}{space 3} .0013497
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .0180063{col 35}{space 2} .1067704{col 46}{space 1}    0.17{col 55}{space 3}0.866{col 63}{space 4}-.1912598{col 76}{space 3} .2272724
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 5.426478{col 35}{space 2} 2.389533{col 46}{space 1}    2.27{col 55}{space 3}0.023{col 63}{space 4} .7430791{col 76}{space 3} 10.10988
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.201
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0166
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   9.810
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.021
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8850
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 3 
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.1916e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     140
{txt}{col 55}F(  1,   138) = {res}   15.25
{txt}{col 55}Prob > F      = {res}  0.0001
{txt}Total (centered) SS     = {res} 378.4658289{txt}{col 55}Centered R2   = {res}  0.1159
{txt}Total (uncentered) SS   = {res} 788.9747681{txt}{col 55}Uncentered R2 = {res}  0.5759
{txt}Residual SS             = {res} 334.6202586{txt}{col 55}Root MSE      = {res}   1.546

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_manu_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.335286{col 32}{space 2} .5938075{col 43}{space 1}   -3.93{col 52}{space 3}0.000{col 60}{space 4}-3.499127{col 73}{space 3}-1.171444
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 4.254914{col 32}{space 2} .6877334{col 43}{space 1}    6.19{col 52}{space 3}0.000{col 60}{space 4} 2.906981{col 73}{space 3} 5.602846
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  21.428
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.0183
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   5.431
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   9.277
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.4121
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 4
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.1890e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     139
{txt}{col 55}F(  7,   131) = {res}    7.90
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 374.3703961{txt}{col 55}Centered R2   = {res}  0.3064
{txt}Total (uncentered) SS   = {res}  783.445551{txt}{col 55}Uncentered R2 = {res}  0.6685
{txt}Residual SS             = {res} 259.6802121{txt}{col 55}Root MSE      = {res}   1.367

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_manu_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-1.358852{col 35}{space 2} .9039871{col 46}{space 1}   -1.50{col 55}{space 3}0.133{col 63}{space 4}-3.130635{col 76}{space 3} .4129298
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-5.48e-06{col 35}{space 2} .0000254{col 46}{space 1}   -0.22{col 55}{space 3}0.829{col 63}{space 4}-.0000553{col 76}{space 3} .0000443
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0063289{col 35}{space 2} .0508095{col 46}{space 1}   -0.12{col 55}{space 3}0.901{col 63}{space 4}-.1059136{col 76}{space 3} .0932559
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0559053{col 35}{space 2} .0793525{col 46}{space 1}   -0.70{col 55}{space 3}0.481{col 63}{space 4}-.2114334{col 76}{space 3} .0996227
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0041001{col 35}{space 2} .0058519{col 46}{space 1}    0.70{col 55}{space 3}0.484{col 63}{space 4}-.0073693{col 76}{space 3} .0155696
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0007007{col 35}{space 2} .0006709{col 46}{space 1}    1.04{col 55}{space 3}0.296{col 63}{space 4}-.0006144{col 76}{space 3} .0020157
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0734516{col 35}{space 2}   .11115{col 46}{space 1}   -0.66{col 55}{space 3}0.509{col 63}{space 4}-.2913017{col 76}{space 3} .1443984
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 6.339886{col 35}{space 2} 2.100369{col 46}{space 1}    3.02{col 55}{space 3}0.003{col 63}{space 4} 2.223238{col 76}{space 3} 10.45653
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.683
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.3828
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.690
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  11.521
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.2417
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 3 
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5276e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      72
{txt}{col 55}F(  1,    70) = {res}    7.44
{txt}{col 55}Prob > F      = {res}  0.0080
{txt}Total (centered) SS     = {res} 200.3386214{txt}{col 55}Centered R2   = {res}  0.1563
{txt}Total (uncentered) SS   = {res} 411.7434545{txt}{col 55}Uncentered R2 = {res}  0.5895
{txt}Residual SS             = {res} 169.0309858{txt}{col 55}Root MSE      = {res}   1.532

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_manu_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.849569{col 32}{space 2} .6684864{col 43}{space 1}   -2.77{col 52}{space 3}0.006{col 60}{space 4}-3.159778{col 73}{space 3}-.5393594
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 3.746296{col 32}{space 2} .9050127{col 43}{space 1}    4.14{col 52}{space 3}0.000{col 60}{space 4} 1.972503{col 73}{space 3} 5.520088
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  31.151
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.0084
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  32.281
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  15.163
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.3671
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 4
. ivreg2 mean_manu_va_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5276e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      72
{txt}{col 55}F(  7,    64) = {res}    4.69
{txt}{col 55}Prob > F      = {res}  0.0003
{txt}Total (centered) SS     = {res} 200.3386214{txt}{col 55}Centered R2   = {res}  0.3057
{txt}Total (uncentered) SS   = {res} 411.7434545{txt}{col 55}Uncentered R2 = {res}  0.6622
{txt}Residual SS             = {res} 139.1011637{txt}{col 55}Root MSE      = {res}    1.39

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_manu_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.1440509{col 35}{space 2} .9955572{col 46}{space 1}   -0.14{col 55}{space 3}0.885{col 63}{space 4}-2.095307{col 76}{space 3} 1.807205
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} .0000957{col 35}{space 2} .0000307{col 46}{space 1}    3.11{col 55}{space 3}0.002{col 63}{space 4} .0000355{col 76}{space 3}  .000156
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .1301531{col 35}{space 2} .0873256{col 46}{space 1}    1.49{col 55}{space 3}0.136{col 63}{space 4} -.041002{col 76}{space 3} .3013082
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .1364653{col 35}{space 2} .0993726{col 46}{space 1}    1.37{col 55}{space 3}0.170{col 63}{space 4}-.0583015{col 76}{space 3}  .331232
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0129981{col 35}{space 2} .0078032{col 46}{space 1}    1.67{col 55}{space 3}0.096{col 63}{space 4}-.0022959{col 76}{space 3} .0282921
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0009641{col 35}{space 2} .0006362{col 46}{space 1}    1.52{col 55}{space 3}0.130{col 63}{space 4}-.0002828{col 76}{space 3}  .002211
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.3579642{col 35}{space 2}  .179012{col 46}{space 1}   -2.00{col 55}{space 3}0.046{col 63}{space 4}-.7088213{col 76}{space 3}-.0071071
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 4.032192{col 35}{space 2} 3.487952{col 46}{space 1}    1.16{col 55}{space 3}0.248{col 63}{space 4}-2.804068{col 76}{space 3} 10.86845
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  19.964
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.1733
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  32.405
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  16.227
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.2997
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. ********************************************************************************
. * Dependent Variable: Value Added, Services (Annual % Growth) * 
. 
. // Panel A, column 5
. reg mean_serv_va_growth_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,324.819)

Linear regression                               Number of obs     = {res}       160
                                                {txt}F(1, 158)         =  {res}    29.71
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.6222
                                                {txt}Root MSE          =    {res} 1.2302

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_serv_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.057986{col 32}{space 2} .3775742{col 43}{space 1}   -5.45{col 52}{space 3}0.000{col 60}{space 4} -2.80373{col 73}{space 3}-1.312242
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 4.564804{col 32}{space 2} .4835605{col 43}{space 1}    9.44{col 52}{space 3}0.000{col 60}{space 4} 3.609727{col 73}{space 3}  5.51988
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 6
. reg mean_serv_va_growth_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,324.819)

Linear regression                               Number of obs     = {res}       160
                                                {txt}F(6, 153)         =  {res}     8.11
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.7114
                                                {txt}Root MSE          =    {res} 1.0926

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_serv_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-1.505163{col 35}{space 2} .5701292{col 46}{space 1}   -2.64{col 55}{space 3}0.009{col 63}{space 4}-2.631505{col 76}{space 3}-.3788213
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}  .000061{col 35}{space 2} .0199349{col 46}{space 1}    0.00{col 55}{space 3}0.998{col 63}{space 4}-.0393223{col 76}{space 3} .0394442
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0738527{col 35}{space 2} .0467213{col 46}{space 1}   -1.58{col 55}{space 3}0.116{col 63}{space 4}-.1661548{col 76}{space 3} .0184495
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0036293{col 35}{space 2} .0043055{col 46}{space 1}    0.84{col 55}{space 3}0.401{col 63}{space 4}-.0048766{col 76}{space 3} .0121351
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0003507{col 35}{space 2}  .000281{col 46}{space 1}    1.25{col 55}{space 3}0.214{col 63}{space 4}-.0002045{col 76}{space 3} .0009059
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.1671306{col 35}{space 2} .0619684{col 46}{space 1}   -2.70{col 55}{space 3}0.008{col 63}{space 4}-.2895547{col 76}{space 3}-.0447065
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 10.31262{col 35}{space 2} 1.617152{col 46}{space 1}    6.38{col 55}{space 3}0.000{col 63}{space 4} 7.117793{col 76}{space 3} 13.50745
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 5
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  1,    75) = {res}   95.12
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 411.8959884{txt}{col 55}Centered R2   = {res}  0.7710
{txt}Total (uncentered) SS   = {res} 1206.108712{txt}{col 55}Uncentered R2 = {res}  0.9218
{txt}Residual SS             = {res} 94.30572153{txt}{col 55}Root MSE      = {res}   1.107

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_serv_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.672136{col 32}{space 2}  .270399{col 43}{space 1}   -9.88{col 52}{space 3}0.000{col 60}{space 4}-3.202108{col 73}{space 3}-2.142164
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.616836{col 32}{space 2} .3830649{col 43}{space 1}   14.66{col 52}{space 3}0.000{col 60}{space 4} 4.866043{col 73}{space 3}  6.36763
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.041
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0812
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   9.907
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 6
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  7,    69) = {res}  158.84
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 411.8959884{txt}{col 55}Centered R2   = {res}  0.7995
{txt}Total (uncentered) SS   = {res} 1206.108712{txt}{col 55}Uncentered R2 = {res}  0.9315
{txt}Residual SS             = {res} 82.58048401{txt}{col 55}Root MSE      = {res}   1.036

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_serv_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-2.844832{col 35}{space 2} 3.043444{col 46}{space 1}   -0.93{col 55}{space 3}0.350{col 63}{space 4}-8.809871{col 76}{space 3} 3.120208
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000372{col 35}{space 2} .0001576{col 46}{space 1}   -0.24{col 55}{space 3}0.813{col 63}{space 4}-.0003462{col 76}{space 3} .0002718
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}  .036001{col 35}{space 2} .2538206{col 46}{space 1}    0.14{col 55}{space 3}0.887{col 63}{space 4}-.4614783{col 76}{space 3} .5334803
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .1249395{col 35}{space 2} .4029884{col 46}{space 1}    0.31{col 55}{space 3}0.757{col 63}{space 4}-.6649033{col 76}{space 3} .9147823
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0071671{col 35}{space 2}    .0292{col 46}{space 1}    0.25{col 55}{space 3}0.806{col 63}{space 4}-.0500638{col 76}{space 3}  .064398
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0006316{col 35}{space 2} .0014535{col 46}{space 1}   -0.43{col 55}{space 3}0.664{col 63}{space 4}-.0034804{col 76}{space 3} .0022172
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .2327215{col 35}{space 2} .0943073{col 46}{space 1}    2.47{col 55}{space 3}0.014{col 63}{space 4} .0478826{col 76}{space 3} .4175604
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-3.751604{col 35}{space 2} 17.87342{col 46}{space 1}   -0.21{col 55}{space 3}0.834{col 63}{space 4}-38.78286{col 76}{space 3} 31.27966
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.565
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.4522
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.479
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 5
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6651e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      87
{txt}{col 55}F(  1,    85) = {res}   37.03
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 467.8234083{txt}{col 55}Centered R2   = {res}  0.7588
{txt}Total (uncentered) SS   = {res} 1377.471516{txt}{col 55}Uncentered R2 = {res}  0.9181
{txt}Residual SS             = {res} 112.8604015{txt}{col 55}Root MSE      = {res}   1.139

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_serv_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.795847{col 32}{space 2} .4541591{col 43}{space 1}   -6.16{col 52}{space 3}0.000{col 60}{space 4}-3.685982{col 73}{space 3}-1.905711
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.732421{col 32}{space 2} .5521848{col 43}{space 1}   10.38{col 52}{space 3}0.000{col 60}{space 4} 4.650159{col 73}{space 3} 6.814684
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.403
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0651
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  13.479
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 6
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6651e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      87
{txt}{col 55}F(  7,    79) = {res}   28.54
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 467.8234083{txt}{col 55}Centered R2   = {res}  0.7238
{txt}Total (uncentered) SS   = {res} 1377.471516{txt}{col 55}Uncentered R2 = {res}  0.9062
{txt}Residual SS             = {res} 129.2059124{txt}{col 55}Root MSE      = {res}   1.219

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_serv_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-3.581219{col 35}{space 2} 1.036561{col 46}{space 1}   -3.45{col 55}{space 3}0.001{col 63}{space 4}-5.612842{col 76}{space 3}-1.549597
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} 1.31e-06{col 35}{space 2} .0000512{col 46}{space 1}    0.03{col 55}{space 3}0.980{col 63}{space 4}-.0000991{col 76}{space 3} .0001017
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .1070231{col 35}{space 2} .1549797{col 46}{space 1}    0.69{col 55}{space 3}0.490{col 63}{space 4}-.1967314{col 76}{space 3} .4107777
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .2338695{col 35}{space 2} .2384849{col 46}{space 1}    0.98{col 55}{space 3}0.327{col 63}{space 4}-.2335522{col 76}{space 3} .7012913
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0147619{col 35}{space 2} .0116012{col 46}{space 1}    1.27{col 55}{space 3}0.203{col 63}{space 4}-.0079761{col 76}{space 3} .0374999
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0009499{col 35}{space 2}  .000342{col 46}{space 1}   -2.78{col 55}{space 3}0.005{col 63}{space 4}-.0016202{col 76}{space 3}-.0002797
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .2373151{col 35}{space 2} .0719978{col 46}{space 1}    3.30{col 55}{space 3}0.001{col 63}{space 4} .0962019{col 76}{space 3} .3784283
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} -8.23857{col 35}{space 2} 8.493379{col 46}{space 1}   -0.97{col 55}{space 3}0.332{col 63}{space 4}-24.88529{col 76}{space 3} 8.408147
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.986
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0144
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  12.060
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 5
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6659e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      91
{txt}{col 55}F(  1,    89) = {res}   36.71
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 489.2729889{txt}{col 55}Centered R2   = {res}  0.7805
{txt}Total (uncentered) SS   = {res} 1441.172747{txt}{col 55}Uncentered R2 = {res}  0.9255
{txt}Residual SS             = {res} 107.3985398{txt}{col 55}Root MSE      = {res}   1.086

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_serv_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.348859{col 32}{space 2} .3833938{col 43}{space 1}   -6.13{col 52}{space 3}0.000{col 60}{space 4}-3.100297{col 73}{space 3}-1.597421
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.333039{col 32}{space 2} .4122114{col 43}{space 1}   12.94{col 52}{space 3}0.000{col 60}{space 4} 4.525119{col 73}{space 3} 6.140958
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.480
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1153
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   5.884
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 6
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6659e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      91
{txt}{col 55}F(  7,    83) = {res}    0.05
{txt}{col 55}Prob > F      = {res}  0.9998
{txt}Total (centered) SS     = {res} 489.2729889{txt}{col 55}Centered R2   = {res}-55.2426
{txt}Total (uncentered) SS   = {res} 1441.172747{txt}{col 55}Uncentered R2 = {res}-18.0942
{txt}Residual SS             = {res} 27518.00333{txt}{col 55}Root MSE      = {res}   17.39

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_serv_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 37.40792{col 35}{space 2} 250.9591{col 46}{space 1}    0.15{col 55}{space 3}0.882{col 63}{space 4}-454.4629{col 76}{space 3} 529.2787
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0020586{col 35}{space 2} .0124996{col 46}{space 1}   -0.16{col 55}{space 3}0.869{col 63}{space 4}-.0265573{col 76}{space 3} .0224401
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-3.578425{col 35}{space 2} 22.28872{col 46}{space 1}   -0.16{col 55}{space 3}0.872{col 63}{space 4}-47.26351{col 76}{space 3} 40.10666
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-5.682977{col 35}{space 2} 36.20615{col 46}{space 1}   -0.16{col 55}{space 3}0.875{col 63}{space 4}-76.64573{col 76}{space 3} 65.27977
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.3604697{col 35}{space 2} 2.262181{col 46}{space 1}   -0.16{col 55}{space 3}0.873{col 63}{space 4}-4.794263{col 76}{space 3} 4.073324
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0168328{col 35}{space 2} .1104061{col 46}{space 1}    0.15{col 55}{space 3}0.879{col 63}{space 4}-.1995593{col 76}{space 3} .2332248
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.5254864{col 35}{space 2} 5.411722{col 46}{space 1}   -0.10{col 55}{space 3}0.923{col 63}{space 4}-11.13227{col 76}{space 3} 10.08129
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 242.3301{col 35}{space 2} 1535.621{col 46}{space 1}    0.16{col 55}{space 3}0.875{col 63}{space 4}-2767.432{col 76}{space 3} 3252.092
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.023
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8802
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.021
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 5
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3069e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     134
{txt}{col 55}F(  1,   132) = {res}    2.03
{txt}{col 55}Prob > F      = {res}  0.1565
{txt}Total (centered) SS     = {res} 526.3479558{txt}{col 55}Centered R2   = {res}  0.5612
{txt}Total (uncentered) SS   = {res} 1374.913399{txt}{col 55}Uncentered R2 = {res}  0.8320
{txt}Residual SS             = {res} 230.9801821{txt}{col 55}Root MSE      = {res}   1.313

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_serv_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.427779{col 32}{space 2} .9943928{col 43}{space 1}   -1.44{col 52}{space 3}0.151{col 60}{space 4}-3.376753{col 73}{space 3} .5211955
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 3.939483{col 32}{space 2} 1.260492{col 43}{space 1}    3.13{col 52}{space 3}0.002{col 60}{space 4} 1.468965{col 73}{space 3} 6.410001
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.098
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0782
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.876
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   1.484
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.2232
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 6
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3043e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     133
{txt}{col 55}F(  7,   125) = {res}    7.62
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 522.4160096{txt}{col 55}Centered R2   = {res}  0.7494
{txt}Total (uncentered) SS   = {res} 1363.606441{txt}{col 55}Uncentered R2 = {res}  0.9040
{txt}Residual SS             = {res} 130.9068872{txt}{col 55}Root MSE      = {res}   .9921

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_serv_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-1.014552{col 35}{space 2} .5111419{col 46}{space 1}   -1.98{col 55}{space 3}0.047{col 63}{space 4}-2.016372{col 76}{space 3}-.0127325
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000582{col 35}{space 2} .0000249{col 46}{space 1}   -2.34{col 55}{space 3}0.019{col 63}{space 4}-.0001069{col 76}{space 3}-9.48e-06
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0405756{col 35}{space 2}  .033588{col 46}{space 1}   -1.21{col 55}{space 3}0.227{col 63}{space 4}-.1064067{col 76}{space 3} .0252556
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} -.127948{col 35}{space 2} .0632118{col 46}{space 1}   -2.02{col 55}{space 3}0.043{col 63}{space 4}-.2518408{col 76}{space 3}-.0040551
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0008826{col 35}{space 2} .0040919{col 46}{space 1}    0.22{col 55}{space 3}0.829{col 63}{space 4}-.0071374{col 76}{space 3} .0089025
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0004435{col 35}{space 2}   .00025{col 46}{space 1}    1.77{col 55}{space 3}0.076{col 63}{space 4}-.0000466{col 76}{space 3} .0009335
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0921091{col 35}{space 2} .0711391{col 46}{space 1}   -1.29{col 55}{space 3}0.195{col 63}{space 4}-.2315393{col 76}{space 3}  .047321
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 11.04666{col 35}{space 2} 1.900159{col 46}{space 1}    5.81{col 55}{space 3}0.000{col 63}{space 4} 7.322415{col 76}{space 3}  14.7709
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   7.758
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0207
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.559
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   4.736
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0295
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 5 
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3117e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     139
{txt}{col 55}F(  1,   137) = {res}   33.36
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 548.2777914{txt}{col 55}Centered R2   = {res}  0.5545
{txt}Total (uncentered) SS   = {res} 1432.447478{txt}{col 55}Uncentered R2 = {res}  0.8295
{txt}Residual SS             = {res}  244.283137{txt}{col 55}Root MSE      = {res}   1.326

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_serv_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.752385{col 32}{space 2} .4730812{col 43}{space 1}   -5.82{col 52}{space 3}0.000{col 60}{space 4}-3.679607{col 73}{space 3}-1.825162
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.254992{col 32}{space 2} .5467319{col 43}{space 1}    9.61{col 52}{space 3}0.000{col 60}{space 4} 4.183417{col 73}{space 3} 6.326567
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  19.272
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.0369
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   4.408
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   9.987
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.3515
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 6
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3091e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     138
{txt}{col 55}F(  7,   130) = {res}    9.06
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 544.3334186{txt}{col 55}Centered R2   = {res}  0.7522
{txt}Total (uncentered) SS   = {res} 1421.062742{txt}{col 55}Uncentered R2 = {res}  0.9051
{txt}Residual SS             = {res} 134.8998907{txt}{col 55}Root MSE      = {res}   .9887

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_serv_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} -1.40293{col 35}{space 2} .6728306{col 46}{space 1}   -2.09{col 55}{space 3}0.037{col 63}{space 4}-2.721654{col 76}{space 3}-.0842066
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} -.000048{col 35}{space 2}  .000024{col 46}{space 1}   -2.00{col 55}{space 3}0.046{col 63}{space 4}-.0000952{col 76}{space 3}-9.14e-07
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0325769{col 35}{space 2} .0304073{col 46}{space 1}   -1.07{col 55}{space 3}0.284{col 63}{space 4}-.0921741{col 76}{space 3} .0270203
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.1139082{col 35}{space 2}  .055507{col 46}{space 1}   -2.05{col 55}{space 3}0.040{col 63}{space 4}   -.2227{col 76}{space 3}-.0051164
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0018219{col 35}{space 2} .0043781{col 46}{space 1}    0.42{col 55}{space 3}0.677{col 63}{space 4}-.0067589{col 76}{space 3} .0104028
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0002779{col 35}{space 2} .0003173{col 46}{space 1}    0.88{col 55}{space 3}0.381{col 63}{space 4} -.000344{col 76}{space 3} .0008998
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0786326{col 35}{space 2} .0699297{col 46}{space 1}   -1.12{col 55}{space 3}0.261{col 63}{space 4}-.2156924{col 76}{space 3} .0584271
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 10.19283{col 35}{space 2} 1.833353{col 46}{space 1}    5.56{col 55}{space 3}0.000{col 63}{space 4}  6.59952{col 76}{space 3} 13.78613
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.736
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.3785
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.752
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  13.556
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.1390
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 5 
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  1,    71) = {res}  177.70
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 389.8017549{txt}{col 55}Centered R2   = {res}  0.7798
{txt}Total (uncentered) SS   = {res}  1138.94975{txt}{col 55}Uncentered R2 = {res}  0.9246
{txt}Residual SS             = {res}  85.8419801{txt}{col 55}Root MSE      = {res}   1.084

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_serv_va_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.581345{col 32}{space 2} .1909698{col 43}{space 1}  -13.52{col 52}{space 3}0.000{col 60}{space 4}-2.955639{col 73}{space 3}-2.207051
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.541352{col 32}{space 2}  .313745{col 43}{space 1}   17.66{col 52}{space 3}0.000{col 60}{space 4} 4.926423{col 73}{space 3} 6.156281
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  21.884
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.1109
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  84.236
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  11.323
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.6605
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 6
. ivreg2 mean_serv_va_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  7,    65) = {res}  254.88
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 389.8017549{txt}{col 55}Centered R2   = {res}  0.8293
{txt}Total (uncentered) SS   = {res}  1138.94975{txt}{col 55}Uncentered R2 = {res}  0.9416
{txt}Residual SS             = {res} 66.55592599{txt}{col 55}Root MSE      = {res}   .9548

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_serv_va_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-2.433238{col 35}{space 2} .3421165{col 46}{space 1}   -7.11{col 55}{space 3}0.000{col 63}{space 4}-3.103774{col 76}{space 3}-1.762702
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000587{col 35}{space 2} .0000218{col 46}{space 1}   -2.70{col 55}{space 3}0.007{col 63}{space 4}-.0001013{col 76}{space 3}-.0000161
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0022655{col 35}{space 2} .0632443{col 46}{space 1}    0.04{col 55}{space 3}0.971{col 63}{space 4} -.121691{col 76}{space 3} .1262221
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}  .070035{col 35}{space 2} .0882202{col 46}{space 1}    0.79{col 55}{space 3}0.427{col 63}{space 4}-.1028735{col 76}{space 3} .2429434
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0038627{col 35}{space 2} .0057809{col 46}{space 1}    0.67{col 55}{space 3}0.504{col 63}{space 4}-.0074675{col 76}{space 3}  .015193
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0004587{col 35}{space 2} .0003469{col 46}{space 1}   -1.32{col 55}{space 3}0.186{col 63}{space 4}-.0011387{col 76}{space 3} .0002212
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .2269968{col 35}{space 2} .0743294{col 46}{space 1}    3.05{col 55}{space 3}0.002{col 63}{space 4} .0813139{col 76}{space 3} .3726797
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-1.459962{col 35}{space 2} 3.463555{col 46}{space 1}   -0.42{col 55}{space 3}0.673{col 63}{space 4}-8.248405{col 76}{space 3} 5.328481
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  15.411
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.4222
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.207
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  10.715
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.7083
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. ********************************************************************************
. * Dependent Variable: Capital Stock Formation (Annual % Growth) * 
. 
. // Panel A, column 7
. reg mean_capital_growth_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 32,658.145)

Linear regression                               Number of obs     = {res}       150
                                                {txt}F(1, 148)         =  {res}    41.21
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4210
                                                {txt}Root MSE          =    {res} 2.6226

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_capital_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-2.928443{col 32}{space 2} .4561962{col 43}{space 1}   -6.42{col 52}{space 3}0.000{col 60}{space 4}-3.829943{col 73}{space 3}-2.026944
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.472842{col 32}{space 2}  .612355{col 43}{space 1}    8.94{col 52}{space 3}0.000{col 60}{space 4} 4.262753{col 73}{space 3}  6.68293
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 8
. reg mean_capital_growth_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 32,658.145)

Linear regression                               Number of obs     = {res}       150
                                                {txt}F(6, 143)         =  {res}     8.33
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5261
                                                {txt}Root MSE          =    {res} 2.4137

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_capital_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-2.038817{col 35}{space 2}  .668121{col 46}{space 1}   -3.05{col 55}{space 3}0.003{col 63}{space 4}-3.359486{col 76}{space 3}-.7181471
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0234757{col 35}{space 2} .0327739{col 46}{space 1}    0.72{col 55}{space 3}0.475{col 63}{space 4}-.0413083{col 76}{space 3} .0882596
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.1647773{col 35}{space 2} .0605443{col 46}{space 1}   -2.72{col 55}{space 3}0.007{col 63}{space 4}-.2844548{col 76}{space 3}-.0450998
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0153475{col 35}{space 2} .0111884{col 46}{space 1}    1.37{col 55}{space 3}0.172{col 63}{space 4}-.0067684{col 76}{space 3} .0374635
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0003551{col 35}{space 2} .0025958{col 46}{space 1}    0.14{col 55}{space 3}0.891{col 63}{space 4}-.0047759{col 76}{space 3} .0054862
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.3361849{col 35}{space 2} .0857649{col 46}{space 1}   -3.92{col 55}{space 3}0.000{col 63}{space 4}-.5057156{col 76}{space 3}-.1666541
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 15.91072{col 35}{space 2}    2.686{col 46}{space 1}    5.92{col 55}{space 3}0.000{col 63}{space 4} 10.60132{col 76}{space 3} 21.22011
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 7
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6017e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      70
{txt}{col 55}F(  1,    68) = {res}   34.07
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1173.770787{txt}{col 55}Centered R2   = {res}  0.4154
{txt}Total (uncentered) SS   = {res} 2100.534067{txt}{col 55}Uncentered R2 = {res}  0.6733
{txt}Residual SS             = {res} 686.1430441{txt}{col 55}Root MSE      = {res}   3.131

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_capital_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-3.872711{col 32}{space 2} .6539187{col 43}{space 1}   -5.92{col 52}{space 3}0.000{col 60}{space 4}-5.154368{col 73}{space 3}-2.591054
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 7.112476{col 32}{space 2} .8505072{col 43}{space 1}    8.36{col 52}{space 3}0.000{col 60}{space 4} 5.445513{col 73}{space 3}  8.77944
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.969
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0849
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  10.053
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 8
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6017e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      70
{txt}{col 55}F(  7,    62) = {res}    4.68
{txt}{col 55}Prob > F      = {res}  0.0003
{txt}Total (centered) SS     = {res} 1173.770787{txt}{col 55}Centered R2   = {res}  0.2756
{txt}Total (uncentered) SS   = {res} 2100.534067{txt}{col 55}Uncentered R2 = {res}  0.5952
{txt}Residual SS             = {res} 850.3021086{txt}{col 55}Root MSE      = {res}   3.485

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_capital_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-6.488544{col 35}{space 2} 9.420524{col 46}{space 1}   -0.69{col 55}{space 3}0.491{col 63}{space 4}-24.95243{col 76}{space 3} 11.97534
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} .0000475{col 35}{space 2} .0003672{col 46}{space 1}    0.13{col 55}{space 3}0.897{col 63}{space 4}-.0006722{col 76}{space 3} .0007673
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .3261475{col 35}{space 2} 1.073368{col 46}{space 1}    0.30{col 55}{space 3}0.761{col 63}{space 4}-1.777614{col 76}{space 3} 2.429909
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .6407365{col 35}{space 2} 1.812635{col 46}{space 1}    0.35{col 55}{space 3}0.724{col 63}{space 4}-2.911963{col 76}{space 3} 4.193436
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}  .046024{col 35}{space 2} .0941554{col 46}{space 1}    0.49{col 55}{space 3}0.625{col 63}{space 4}-.1385173{col 76}{space 3} .2305652
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0006538{col 35}{space 2} .0249146{col 46}{space 1}    0.03{col 55}{space 3}0.979{col 63}{space 4}-.0481779{col 76}{space 3} .0494855
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .5685074{col 35}{space 2} .6396972{col 46}{space 1}    0.89{col 55}{space 3}0.374{col 63}{space 4}-.6852761{col 76}{space 3} 1.822291
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-30.79421{col 35}{space 2} 78.74873{col 46}{space 1}   -0.39{col 55}{space 3}0.696{col 63}{space 4}-185.1389{col 76}{space 3} 123.5505
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.750
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.3864
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.614
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 7
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6136e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      80
{txt}{col 55}F(  1,    78) = {res}   29.55
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 970.7767066{txt}{col 55}Centered R2   = {res}  0.6061
{txt}Total (uncentered) SS   = {res} 2061.278457{txt}{col 55}Uncentered R2 = {res}  0.8145
{txt}Residual SS             = {res} 382.4150431{txt}{col 55}Root MSE      = {res}   2.186

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_capital_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-3.779699{col 32}{space 2} .6866108{col 43}{space 1}   -5.50{col 52}{space 3}0.000{col 60}{space 4}-5.125431{col 73}{space 3}-2.433966
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 7.058499{col 32}{space 2} .8814259{col 43}{space 1}    8.01{col 52}{space 3}0.000{col 60}{space 4} 5.330936{col 73}{space 3} 8.786062
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.365
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0666
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  13.622
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 8
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6136e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      80
{txt}{col 55}F(  7,    72) = {res}   34.66
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 970.7767066{txt}{col 55}Centered R2   = {res}  0.7377
{txt}Total (uncentered) SS   = {res} 2061.278457{txt}{col 55}Uncentered R2 = {res}  0.8765
{txt}Residual SS             = {res} 254.6709424{txt}{col 55}Root MSE      = {res}   1.784

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_capital_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-2.958416{col 35}{space 2} 1.229076{col 46}{space 1}   -2.41{col 55}{space 3}0.016{col 63}{space 4}-5.367362{col 76}{space 3}-.5494705
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000889{col 35}{space 2} .0000678{col 46}{space 1}   -1.31{col 55}{space 3}0.189{col 63}{space 4}-.0002217{col 76}{space 3} .0000439
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0795621{col 35}{space 2} .1521864{col 46}{space 1}   -0.52{col 55}{space 3}0.601{col 63}{space 4} -.377842{col 76}{space 3} .2187177
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0355322{col 35}{space 2} .2466646{col 46}{space 1}   -0.14{col 55}{space 3}0.885{col 63}{space 4}-.5189859{col 76}{space 3} .4479215
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0098023{col 35}{space 2} .0245673{col 46}{space 1}    0.40{col 55}{space 3}0.690{col 63}{space 4}-.0383487{col 76}{space 3} .0579533
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0086823{col 35}{space 2} .0059864{col 46}{space 1}    1.45{col 55}{space 3}0.147{col 63}{space 4}-.0030509{col 76}{space 3} .0204154
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .3595301{col 35}{space 2}  .206028{col 46}{space 1}    1.75{col 55}{space 3}0.081{col 63}{space 4}-.0442773{col 76}{space 3} .7633376
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-1.025431{col 35}{space 2} 11.72585{col 46}{space 1}   -0.09{col 55}{space 3}0.930{col 63}{space 4}-24.00767{col 76}{space 3}  21.9568
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.893
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0010
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  43.096
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 7
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6142e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      83
{txt}{col 55}F(  1,    81) = {res}   25.28
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1398.172616{txt}{col 55}Centered R2   = {res}  0.4339
{txt}Total (uncentered) SS   = {res}  2520.10448{txt}{col 55}Uncentered R2 = {res}  0.6859
{txt}Residual SS             = {res} 791.4899453{txt}{col 55}Root MSE      = {res}   3.088

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_capital_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-3.551002{col 32}{space 2} .6976421{col 43}{space 1}   -5.09{col 52}{space 3}0.000{col 60}{space 4}-4.918356{col 73}{space 3}-2.183649
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 6.838995{col 32}{space 2} .8150768{col 43}{space 1}    8.39{col 52}{space 3}0.000{col 60}{space 4} 5.241474{col 73}{space 3} 8.436516
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.480
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1153
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   5.981
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 8
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6142e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      83
{txt}{col 55}F(  7,    75) = {res}  444.04
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1398.172616{txt}{col 55}Centered R2   = {res}  0.5466
{txt}Total (uncentered) SS   = {res}  2520.10448{txt}{col 55}Uncentered R2 = {res}  0.7485
{txt}Residual SS             = {res} 633.8787035{txt}{col 55}Root MSE      = {res}   2.764

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_capital_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-1.580262{col 35}{space 2} 2.899308{col 46}{space 1}   -0.55{col 55}{space 3}0.586{col 63}{space 4}-7.262801{col 76}{space 3} 4.102276
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0001417{col 35}{space 2} .0001274{col 46}{space 1}   -1.11{col 55}{space 3}0.266{col 63}{space 4}-.0003913{col 76}{space 3} .0001079
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.2255896{col 35}{space 2} .3420112{col 46}{space 1}   -0.66{col 55}{space 3}0.510{col 63}{space 4}-.8959192{col 76}{space 3}   .44474
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.3018014{col 35}{space 2} .5724852{col 46}{space 1}   -0.53{col 55}{space 3}0.598{col 63}{space 4}-1.423852{col 76}{space 3}  .820249
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0008937{col 35}{space 2} .0320422{col 46}{space 1}   -0.03{col 55}{space 3}0.978{col 63}{space 4}-.0636953{col 76}{space 3} .0619079
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0118465{col 35}{space 2} .0086446{col 46}{space 1}    1.37{col 55}{space 3}0.171{col 63}{space 4}-.0050965{col 76}{space 3} .0287896
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .2763894{col 35}{space 2} .2484678{col 46}{space 1}    1.11{col 55}{space 3}0.266{col 63}{space 4}-.2105985{col 76}{space 3} .7633773
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 9.976898{col 35}{space 2} 24.23132{col 46}{space 1}    0.41{col 55}{space 3}0.681{col 63}{space 4}-37.51562{col 76}{space 3} 57.46942
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   1.423
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.2330
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.528
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 7
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2402e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     124
{txt}{col 55}F(  1,   122) = {res}    1.47
{txt}{col 55}Prob > F      = {res}  0.2280
{txt}Total (centered) SS     = {res} 1437.123747{txt}{col 55}Centered R2   = {res}  0.3651
{txt}Total (uncentered) SS   = {res} 2232.218699{txt}{col 55}Uncentered R2 = {res}  0.5912
{txt}Residual SS             = {res} 912.4313098{txt}{col 55}Root MSE      = {res}   2.713

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_capital_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-1.898667{col 32}{space 2} 1.554301{col 43}{space 1}   -1.22{col 52}{space 3}0.222{col 60}{space 4}-4.945041{col 73}{space 3} 1.147708
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 4.436148{col 32}{space 2} 1.963911{col 43}{space 1}    2.26{col 52}{space 3}0.024{col 60}{space 4} .5869542{col 73}{space 3} 8.285342
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   4.707
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0950
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.713
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   1.562
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.2114
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 8
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2376e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     123
{txt}{col 55}F(  7,   115) = {res}    8.06
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res}  1421.61023{txt}{col 55}Centered R2   = {res}  0.5349
{txt}Total (uncentered) SS   = {res} 2206.727246{txt}{col 55}Uncentered R2 = {res}  0.7004
{txt}Residual SS             = {res} 661.1257667{txt}{col 55}Root MSE      = {res}   2.318

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_capital_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-1.504178{col 35}{space 2} .7486158{col 46}{space 1}   -2.01{col 55}{space 3}0.045{col 63}{space 4}-2.971438{col 76}{space 3}-.0369182
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000603{col 35}{space 2} .0000349{col 46}{space 1}   -1.73{col 55}{space 3}0.084{col 63}{space 4}-.0001287{col 76}{space 3} 8.11e-06
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0239882{col 35}{space 2} .0492587{col 46}{space 1}   -0.49{col 55}{space 3}0.626{col 63}{space 4}-.1205336{col 76}{space 3} .0725571
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.2218113{col 35}{space 2} .0897481{col 46}{space 1}   -2.47{col 55}{space 3}0.013{col 63}{space 4}-.3977142{col 76}{space 3}-.0459083
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0117723{col 35}{space 2} .0117925{col 46}{space 1}    1.00{col 55}{space 3}0.318{col 63}{space 4}-.0113407{col 76}{space 3} .0348852
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0006272{col 35}{space 2} .0027325{col 46}{space 1}    0.23{col 55}{space 3}0.818{col 63}{space 4}-.0047285{col 76}{space 3} .0059829
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.2535554{col 35}{space 2} .0905927{col 46}{space 1}   -2.80{col 55}{space 3}0.005{col 63}{space 4}-.4311138{col 76}{space 3} -.075997
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 16.72177{col 35}{space 2} 3.529237{col 46}{space 1}    4.74{col 55}{space 3}0.000{col 63}{space 4} 9.804588{col 76}{space 3} 23.63895
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  12.174
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0023
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.192
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   3.553
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0594
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 7 
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2449e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     128
{txt}{col 55}F(  1,   126) = {res}   22.34
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1484.288202{txt}{col 55}Centered R2   = {res}  0.3958
{txt}Total (uncentered) SS   = {res} 2308.776632{txt}{col 55}Uncentered R2 = {res}  0.6115
{txt}Residual SS             = {res} 896.8491224{txt}{col 55}Root MSE      = {res}   2.647

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_capital_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-3.593997{col 32}{space 2} .7543956{col 43}{space 1}   -4.76{col 52}{space 3}0.000{col 60}{space 4}-5.072586{col 73}{space 3}-2.115409
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 6.128194{col 32}{space 2}  .883117{col 43}{space 1}    6.94{col 52}{space 3}0.000{col 60}{space 4} 4.397316{col 73}{space 3} 7.859072
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  17.716
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.0599
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   3.901
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   8.212
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.5129
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 8
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2424e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     127
{txt}{col 55}F(  7,   119) = {res}    7.85
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1468.655741{txt}{col 55}Centered R2   = {res}  0.5350
{txt}Total (uncentered) SS   = {res} 2283.020955{txt}{col 55}Uncentered R2 = {res}  0.7009
{txt}Residual SS             = {res} 682.9095719{txt}{col 55}Root MSE      = {res}   2.319

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_capital_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-1.420216{col 35}{space 2} .9070481{col 46}{space 1}   -1.57{col 55}{space 3}0.117{col 63}{space 4}-3.197998{col 76}{space 3} .3575652
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000615{col 35}{space 2} .0000331{col 46}{space 1}   -1.86{col 55}{space 3}0.063{col 63}{space 4}-.0001264{col 76}{space 3} 3.43e-06
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0261587{col 35}{space 2} .0451085{col 46}{space 1}   -0.58{col 55}{space 3}0.562{col 63}{space 4}-.1145696{col 76}{space 3} .0622523
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.2252301{col 35}{space 2} .0878753{col 46}{space 1}   -2.56{col 55}{space 3}0.010{col 63}{space 4}-.3974625{col 76}{space 3}-.0529977
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0114763{col 35}{space 2} .0110737{col 46}{space 1}    1.04{col 55}{space 3}0.300{col 63}{space 4}-.0102278{col 76}{space 3} .0331804
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}  .000733{col 35}{space 2} .0027628{col 46}{space 1}    0.27{col 55}{space 3}0.791{col 63}{space 4}-.0046819{col 76}{space 3}  .006148
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.2576552{col 35}{space 2} .0939724{col 46}{space 1}   -2.74{col 55}{space 3}0.006{col 63}{space 4}-.4418378{col 76}{space 3}-.0734726
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 16.93437{col 35}{space 2} 3.058478{col 46}{space 1}    5.54{col 55}{space 3}0.000{col 63}{space 4} 10.93986{col 76}{space 3} 22.92887
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  13.635
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.1903
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.208
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  10.198
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.3347
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 7 
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5972e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      67
{txt}{col 55}F(  1,    65) = {res}   92.12
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 802.6886791{txt}{col 55}Centered R2   = {res}  0.6070
{txt}Total (uncentered) SS   = {res} 1690.908541{txt}{col 55}Uncentered R2 = {res}  0.8135
{txt}Residual SS             = {res} 315.4197033{txt}{col 55}Root MSE      = {res}    2.17

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_capital_~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-3.747133{col 32}{space 2} .3845477{col 43}{space 1}   -9.74{col 52}{space 3}0.000{col 60}{space 4}-4.500832{col 73}{space 3}-2.993433
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 7.023092{col 32}{space 2} .6069139{col 43}{space 1}   11.57{col 52}{space 3}0.000{col 60}{space 4} 5.833563{col 73}{space 3} 8.212621
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  23.963
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.0657
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71} 6.5e+04
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  14.960
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.3809
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 8
. ivreg2 mean_capital_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.5972e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      67
{txt}{col 55}F(  7,    59) = {res}   47.93
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 802.6886791{txt}{col 55}Centered R2   = {res}  0.7518
{txt}Total (uncentered) SS   = {res} 1690.908541{txt}{col 55}Uncentered R2 = {res}  0.8822
{txt}Residual SS             = {res} 199.2132133{txt}{col 55}Root MSE      = {res}   1.724

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_capital_gro~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} -2.59807{col 35}{space 2} .9105302{col 46}{space 1}   -2.85{col 55}{space 3}0.004{col 63}{space 4}-4.382676{col 76}{space 3}-.8134633
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0001127{col 35}{space 2} .0000652{col 46}{space 1}   -1.73{col 55}{space 3}0.084{col 63}{space 4}-.0002405{col 76}{space 3} .0000151
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.1180797{col 35}{space 2} .1216692{col 46}{space 1}   -0.97{col 55}{space 3}0.332{col 63}{space 4} -.356547{col 76}{space 3} .1203876
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0783217{col 35}{space 2} .1786198{col 46}{space 1}   -0.44{col 55}{space 3}0.661{col 63}{space 4}-.4284101{col 76}{space 3} .2717667
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0053055{col 35}{space 2} .0240841{col 46}{space 1}    0.22{col 55}{space 3}0.826{col 63}{space 4}-.0418985{col 76}{space 3} .0525095
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0096101{col 35}{space 2} .0053617{col 46}{space 1}    1.79{col 55}{space 3}0.073{col 63}{space 4}-.0008986{col 76}{space 3} .0201188
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .3957011{col 35}{space 2} .2163969{col 46}{space 1}    1.83{col 55}{space 3}0.067{col 63}{space 4} -.028429{col 76}{space 3} .8198311
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}  .088931{col 35}{space 2} 9.541551{col 46}{space 1}    0.01{col 55}{space 3}0.993{col 63}{space 4}-18.61217{col 76}{space 3} 18.79003
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  16.596
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.3436
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  18.226
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  18.919
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.1681
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. ********************************************************************************
. * Dependent Variable: Labor Force (Annual % Growth) * 
. 
. // Panel A, column 9
. reg mean_labor_growth_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,367.517)

Linear regression                               Number of obs     = {res}       163
                                                {txt}F(1, 161)         =  {res}     0.34
                                                {txt}Prob > F          = {res}    0.5591
                                                {txt}R-squared         = {res}    0.0302
                                                {txt}Root MSE          =    {res} .34561

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_labor_gr~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.0790016{col 32}{space 2}  .134939{col 43}{space 1}   -0.59{col 52}{space 3}0.559{col 60}{space 4}-.3454803{col 73}{space 3} .1874771
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}  -2.1105{col 32}{space 2} .1611165{col 43}{space 1}  -13.10{col 52}{space 3}0.000{col 60}{space 4}-2.428674{col 73}{space 3}-1.792326
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 10
. reg mean_labor_growth_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,367.517)

Linear regression                               Number of obs     = {res}       163
                                                {txt}F(6, 156)         =  {res}     4.08
                                                {txt}Prob > F          = {res}    0.0008
                                                {txt}R-squared         = {res}    0.3296
                                                {txt}Root MSE          =    {res} .29192

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_labor_growt~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.0829435{col 35}{space 2} .1233652{col 46}{space 1}   -0.67{col 55}{space 3}0.502{col 63}{space 4}-.3266253{col 76}{space 3} .1607383
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}  .011272{col 35}{space 2} .0083835{col 46}{space 1}    1.34{col 55}{space 3}0.181{col 63}{space 4}-.0052879{col 76}{space 3} .0278318
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .0337898{col 35}{space 2} .0154492{col 46}{space 1}    2.19{col 55}{space 3}0.030{col 63}{space 4} .0032731{col 76}{space 3} .0643064
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0027453{col 35}{space 2} .0012697{col 46}{space 1}    2.16{col 55}{space 3}0.032{col 63}{space 4} .0002373{col 76}{space 3} .0052534
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0000185{col 35}{space 2}   .00005{col 46}{space 1}   -0.37{col 55}{space 3}0.711{col 63}{space 4}-.0001173{col 76}{space 3} .0000802
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .0019511{col 35}{space 2} .0158774{col 46}{space 1}    0.12{col 55}{space 3}0.902{col 63}{space 4}-.0294113{col 76}{space 3} .0333135
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-3.183478{col 35}{space 2} .6061027{col 46}{space 1}   -5.25{col 55}{space 3}0.000{col 63}{space 4}-4.380705{col 76}{space 3}-1.986251
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 9
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  1,    75) = {res}    0.72
{txt}{col 55}Prob > F      = {res}  0.3976
{txt}Total (centered) SS     = {res} 6.392373239{txt}{col 55}Centered R2   = {res} -0.2007
{txt}Total (uncentered) SS   = {res} 428.6367367{txt}{col 55}Uncentered R2 = {res}  0.9821
{txt}Residual SS             = {res} 7.675053491{txt}{col 55}Root MSE      = {res}   .3157

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_labor_gr~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.1655567{col 32}{space 2} .1920568{col 43}{space 1}   -0.86{col 52}{space 3}0.389{col 60}{space 4}-.5419811{col 73}{space 3} .2108678
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.192709{col 32}{space 2} .2341121{col 43}{space 1}   -9.37{col 52}{space 3}0.000{col 60}{space 4} -2.65156{col 73}{space 3}-1.733858
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.041
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0812
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   9.907
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 10
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  7,    69) = {res}    2.44
{txt}{col 55}Prob > F      = {res}  0.0272
{txt}Total (centered) SS     = {res} 6.392373239{txt}{col 55}Centered R2   = {res} -0.1996
{txt}Total (uncentered) SS   = {res} 428.6367367{txt}{col 55}Uncentered R2 = {res}  0.9821
{txt}Residual SS             = {res} 7.668020848{txt}{col 55}Root MSE      = {res}   .3156

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_labor_growt~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} .7764557{col 35}{space 2} 1.005427{col 46}{space 1}    0.77{col 55}{space 3}0.440{col 63}{space 4}-1.194145{col 76}{space 3} 2.747056
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000368{col 35}{space 2} .0000512{col 46}{space 1}   -0.72{col 55}{space 3}0.472{col 63}{space 4}-.0001371{col 76}{space 3} .0000635
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0389592{col 35}{space 2} .0919928{col 46}{space 1}   -0.42{col 55}{space 3}0.672{col 63}{space 4}-.2192619{col 76}{space 3} .1413434
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0656756{col 35}{space 2} .1449592{col 46}{space 1}   -0.45{col 55}{space 3}0.651{col 63}{space 4}-.3497904{col 76}{space 3} .2184392
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0041046{col 35}{space 2} .0091633{col 46}{space 1}   -0.45{col 55}{space 3}0.654{col 63}{space 4}-.0220643{col 76}{space 3} .0138551
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0003887{col 35}{space 2} .0004372{col 46}{space 1}    0.89{col 55}{space 3}0.374{col 63}{space 4}-.0004681{col 76}{space 3} .0012455
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0409324{col 35}{space 2} .0364157{col 46}{space 1}   -1.12{col 55}{space 3}0.261{col 63}{space 4}-.1123059{col 76}{space 3} .0304411
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 1.458973{col 35}{space 2} 6.204912{col 46}{space 1}    0.24{col 55}{space 3}0.814{col 63}{space 4}-10.70243{col 76}{space 3} 13.62038
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.565
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.4522
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.479
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 9
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6690e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      89
{txt}{col 55}F(  1,    87) = {res}    0.26
{txt}{col 55}Prob > F      = {res}  0.6088
{txt}Total (centered) SS     = {res} 7.555452175{txt}{col 55}Centered R2   = {res} -0.0193
{txt}Total (uncentered) SS   = {res} 493.5302082{txt}{col 55}Uncentered R2 = {res}  0.9844
{txt}Residual SS             = {res} 7.701473965{txt}{col 55}Root MSE      = {res}   .2942

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_labor_gr~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.0727351{col 32}{space 2}  .139996{col 43}{space 1}   -0.52{col 52}{space 3}0.603{col 60}{space 4}-.3471223{col 73}{space 3} .2016521
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.272164{col 32}{space 2} .1653861{col 43}{space 1}  -13.74{col 52}{space 3}0.000{col 60}{space 4}-2.596315{col 73}{space 3}-1.948013
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.531
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0602
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.119
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 10
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6690e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      89
{txt}{col 55}F(  7,    81) = {res}   25.77
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 7.555452175{txt}{col 55}Centered R2   = {res}  0.4935
{txt}Total (uncentered) SS   = {res} 493.5302082{txt}{col 55}Uncentered R2 = {res}  0.9922
{txt}Residual SS             = {res} 3.826590578{txt}{col 55}Root MSE      = {res}   .2074

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_labor_growt~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} .4495162{col 35}{space 2} .1822659{col 46}{space 1}    2.47{col 55}{space 3}0.014{col 63}{space 4} .0922817{col 76}{space 3} .8067507
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000197{col 35}{space 2} .0000109{col 46}{space 1}   -1.82{col 55}{space 3}0.069{col 63}{space 4} -.000041{col 76}{space 3} 1.57e-06
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.0077809{col 35}{space 2} .0245415{col 46}{space 1}   -0.32{col 55}{space 3}0.751{col 63}{space 4}-.0558814{col 76}{space 3} .0403196
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.0167474{col 35}{space 2} .0382975{col 46}{space 1}   -0.44{col 55}{space 3}0.662{col 63}{space 4}-.0918092{col 76}{space 3} .0583144
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0010259{col 35}{space 2} .0020356{col 46}{space 1}   -0.50{col 55}{space 3}0.614{col 63}{space 4}-.0050156{col 76}{space 3} .0029638
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0002503{col 35}{space 2} .0000645{col 46}{space 1}    3.88{col 55}{space 3}0.000{col 63}{space 4} .0001239{col 76}{space 3} .0003767
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} -.038717{col 35}{space 2} .0213058{col 46}{space 1}   -1.82{col 55}{space 3}0.069{col 63}{space 4}-.0804757{col 76}{space 3} .0030417
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-.5116611{col 35}{space 2} 1.435246{col 46}{space 1}   -0.36{col 55}{space 3}0.721{col 63}{space 4}-3.324692{col 76}{space 3}  2.30137
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   6.155
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0131
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  12.186
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 9
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6698e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      93
{txt}{col 55}F(  1,    91) = {res}    0.72
{txt}{col 55}Prob > F      = {res}  0.3993
{txt}Total (centered) SS     = {res} 7.903538482{txt}{col 55}Centered R2   = {res} -0.2678
{txt}Total (uncentered) SS   = {res} 515.6147793{txt}{col 55}Uncentered R2 = {res}  0.9806
{txt}Residual SS             = {res} 10.01971876{txt}{col 55}Root MSE      = {res}   .3282

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_labor_gr~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.1972126{col 32}{space 2} .2303625{col 43}{space 1}   -0.86{col 52}{space 3}0.392{col 60}{space 4}-.6487148{col 73}{space 3} .2542897
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.161444{col 32}{space 2} .2724469{col 43}{space 1}   -7.93{col 52}{space 3}0.000{col 60}{space 4} -2.69543{col 73}{space 3}-1.627458
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.573
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1087
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   6.176
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 10
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6698e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      93
{txt}{col 55}F(  7,    85) = {res}    3.59
{txt}{col 55}Prob > F      = {res}  0.0020
{txt}Total (centered) SS     = {res} 7.903538482{txt}{col 55}Centered R2   = {res} -0.3756
{txt}Total (uncentered) SS   = {res} 515.6147793{txt}{col 55}Uncentered R2 = {res}  0.9789
{txt}Residual SS             = {res} 10.87249515{txt}{col 55}Root MSE      = {res}   .3419

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_labor_growt~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.5304151{col 35}{space 2} 2.330599{col 46}{space 1}   -0.23{col 55}{space 3}0.820{col 63}{space 4}-5.098305{col 76}{space 3} 4.037475
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} .0000291{col 35}{space 2} .0001145{col 46}{space 1}    0.25{col 55}{space 3}0.799{col 63}{space 4}-.0001953{col 76}{space 3} .0002534
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0802825{col 35}{space 2} .1998536{col 46}{space 1}    0.40{col 55}{space 3}0.688{col 63}{space 4}-.3114234{col 76}{space 3} .4719885
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .1235243{col 35}{space 2} .3311538{col 46}{space 1}    0.37{col 55}{space 3}0.709{col 63}{space 4}-.5255253{col 76}{space 3} .7725739
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0083491{col 35}{space 2} .0214928{col 46}{space 1}    0.39{col 55}{space 3}0.698{col 63}{space 4} -.033776{col 76}{space 3} .0504742
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}  -.00018{col 35}{space 2} .0010643{col 46}{space 1}   -0.17{col 55}{space 3}0.866{col 63}{space 4} -.002266{col 76}{space 3}  .001906
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0177626{col 35}{space 2} .0694096{col 46}{space 1}   -0.26{col 55}{space 3}0.798{col 63}{space 4}-.1538029{col 76}{space 3} .1182777
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} -6.59437{col 35}{space 2} 14.36379{col 46}{space 1}   -0.46{col 55}{space 3}0.646{col 63}{space 4}-34.74687{col 76}{space 3} 21.55813
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.057
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8105
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.054
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 9
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3073e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     135
{txt}{col 55}F(  1,   133) = {res}    2.34
{txt}{col 55}Prob > F      = {res}  0.1286
{txt}Total (centered) SS     = {res} 16.00246399{txt}{col 55}Centered R2   = {res} -1.2590
{txt}Total (uncentered) SS   = {res} 665.1637091{txt}{col 55}Uncentered R2 = {res}  0.9457
{txt}Residual SS             = {res} 36.14976019{txt}{col 55}Root MSE      = {res}   .5175

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_labor_gr~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.5920634{col 32}{space 2} .3842761{col 43}{space 1}   -1.54{col 52}{space 3}0.123{col 60}{space 4}-1.345231{col 73}{space 3}  .161104
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-1.602755{col 32}{space 2} .4768823{col 43}{space 1}   -3.36{col 52}{space 3}0.001{col 60}{space 4}-2.537427{col 73}{space 3}-.6680832
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.098
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0781
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.877
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.792
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.3734
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 10
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3047e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     134
{txt}{col 55}F(  7,   126) = {res}   12.10
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 15.86045019{txt}{col 55}Centered R2   = {res} -0.1336
{txt}Total (uncentered) SS   = {res} 660.4821025{txt}{col 55}Uncentered R2 = {res}  0.9728
{txt}Residual SS             = {res} 17.97885491{txt}{col 55}Root MSE      = {res}   .3663

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_labor_growt~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.5039905{col 35}{space 2} .1984878{col 46}{space 1}   -2.54{col 55}{space 3}0.011{col 63}{space 4}-.8930194{col 76}{space 3}-.1149617
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} .0000102{col 35}{space 2} .0000117{col 46}{space 1}    0.87{col 55}{space 3}0.386{col 63}{space 4}-.0000128{col 76}{space 3} .0000331
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0192273{col 35}{space 2} .0135265{col 46}{space 1}    1.42{col 55}{space 3}0.155{col 63}{space 4}-.0072842{col 76}{space 3} .0457388
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .0478842{col 35}{space 2} .0268591{col 46}{space 1}    1.78{col 55}{space 3}0.075{col 63}{space 4}-.0047586{col 76}{space 3}  .100527
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0038522{col 35}{space 2} .0014056{col 46}{space 1}    2.74{col 55}{space 3}0.006{col 63}{space 4} .0010972{col 76}{space 3} .0066072
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0001953{col 35}{space 2} .0000859{col 46}{space 1}   -2.27{col 55}{space 3}0.023{col 63}{space 4}-.0003636{col 76}{space 3} -.000027
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .0172275{col 35}{space 2} .0252611{col 46}{space 1}    0.68{col 55}{space 3}0.495{col 63}{space 4}-.0322833{col 76}{space 3} .0667383
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-4.079183{col 35}{space 2} .6355348{col 46}{space 1}   -6.42{col 55}{space 3}0.000{col 63}{space 4}-5.324808{col 76}{space 3}-2.833558
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   7.756
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0207
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.559
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.030
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8627
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 9 
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3159e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     141
{txt}{col 55}F(  1,   139) = {res}    0.43
{txt}{col 55}Prob > F      = {res}  0.5119
{txt}Total (centered) SS     = {res} 16.70272826{txt}{col 55}Centered R2   = {res}  0.0194
{txt}Total (uncentered) SS   = {res} 694.2570619{txt}{col 55}Uncentered R2 = {res}  0.9764
{txt}Residual SS             = {res} 16.37879444{txt}{col 55}Root MSE      = {res}   .3408

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_labor_gr~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} -.116767{col 32}{space 2}  .176329{col 43}{space 1}   -0.66{col 52}{space 3}0.508{col 60}{space 4}-.4623655{col 73}{space 3} .2288315
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.076522{col 32}{space 2}  .190338{col 43}{space 1}  -10.91{col 52}{space 3}0.000{col 60}{space 4}-2.449577{col 73}{space 3}-1.703466
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  19.123
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.0387
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   4.469
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   8.730
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.4626
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 10
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3133e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     140
{txt}{col 55}F(  7,   132) = {res}    4.48
{txt}{col 55}Prob > F      = {res}  0.0002
{txt}Total (centered) SS     = {res} 16.55989079{txt}{col 55}Centered R2   = {res}  0.3366
{txt}Total (uncentered) SS   = {res} 689.5887516{txt}{col 55}Uncentered R2 = {res}  0.9841
{txt}Residual SS             = {res} 10.98646362{txt}{col 55}Root MSE      = {res}   .2801

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_labor_growt~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-.0790562{col 35}{space 2} .1856236{col 46}{space 1}   -0.43{col 55}{space 3}0.670{col 63}{space 4}-.4428718{col 76}{space 3} .2847594
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-1.05e-06{col 35}{space 2} 6.86e-06{col 46}{space 1}   -0.15{col 55}{space 3}0.878{col 63}{space 4}-.0000145{col 76}{space 3} .0000124
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0098297{col 35}{space 2} .0081104{col 46}{space 1}    1.21{col 55}{space 3}0.226{col 63}{space 4}-.0060664{col 76}{space 3} .0257258
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .0322393{col 35}{space 2} .0167354{col 46}{space 1}    1.93{col 55}{space 3}0.054{col 63}{space 4}-.0005614{col 76}{space 3} .0650399
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0027031{col 35}{space 2} .0013834{col 46}{space 1}    1.95{col 55}{space 3}0.051{col 63}{space 4}-8.18e-06{col 76}{space 3} .0054144
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0000186{col 35}{space 2} .0000731{col 46}{space 1}   -0.25{col 55}{space 3}0.799{col 63}{space 4}-.0001619{col 76}{space 3} .0001247
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .0042761{col 35}{space 2} .0205462{col 46}{space 1}    0.21{col 55}{space 3}0.835{col 63}{space 4}-.0359936{col 76}{space 3} .0445458
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-3.169832{col 35}{space 2} .6717588{col 46}{space 1}   -4.72{col 55}{space 3}0.000{col 63}{space 4}-4.486455{col 76}{space 3}-1.853209
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.727
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.3791
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.730
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  13.396
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.1455
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 9 
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  1,    71) = {res}    0.03
{txt}{col 55}Prob > F      = {res}  0.8733
{txt}Total (centered) SS     = {res}  6.04836131{txt}{col 55}Centered R2   = {res}  0.0004
{txt}Total (uncentered) SS   = {res}  406.716852{txt}{col 55}Uncentered R2 = {res}  0.9851
{txt}Residual SS             = {res} 6.045968347{txt}{col 55}Root MSE      = {res}   .2878

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_labor_gr~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.0213699{col 32}{space 2} .1317302{col 43}{space 1}   -0.16{col 52}{space 3}0.871{col 60}{space 4}-.2795564{col 73}{space 3} .2368165
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.323424{col 32}{space 2} .1533542{col 43}{space 1}  -15.15{col 52}{space 3}0.000{col 60}{space 4}-2.623993{col 73}{space 3}-2.022855
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  21.884
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.1109
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  84.236
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  15.553
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.3415
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 10
. ivreg2 mean_labor_growth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  7,    65) = {res}    9.03
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res}  6.04836131{txt}{col 55}Centered R2   = {res}  0.6934
{txt}Total (uncentered) SS   = {res}  406.716852{txt}{col 55}Uncentered R2 = {res}  0.9954
{txt}Residual SS             = {res} 1.854214753{txt}{col 55}Root MSE      = {res}   .1594

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_labor_growt~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} .2406978{col 35}{space 2} .0712035{col 46}{space 1}    3.38{col 55}{space 3}0.001{col 63}{space 4} .1011415{col 76}{space 3}  .380254
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-9.43e-06{col 35}{space 2} 6.11e-06{col 46}{space 1}   -1.54{col 55}{space 3}0.123{col 63}{space 4}-.0000214{col 76}{space 3} 2.55e-06
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0107743{col 35}{space 2} .0105354{col 46}{space 1}    1.02{col 55}{space 3}0.306{col 63}{space 4}-.0098747{col 76}{space 3} .0314233
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .0124401{col 35}{space 2} .0189307{col 46}{space 1}    0.66{col 55}{space 3}0.511{col 63}{space 4}-.0246635{col 76}{space 3} .0495436
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0010862{col 35}{space 2} .0009577{col 46}{space 1}    1.13{col 55}{space 3}0.257{col 63}{space 4}-.0007909{col 76}{space 3} .0029632
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0001571{col 35}{space 2} .0000655{col 46}{space 1}    2.40{col 55}{space 3}0.016{col 63}{space 4} .0000288{col 76}{space 3} .0002855
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0333602{col 35}{space 2} .0214298{col 46}{space 1}   -1.56{col 55}{space 3}0.120{col 63}{space 4}-.0753618{col 76}{space 3} .0086415
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-1.828673{col 35}{space 2} .8086863{col 46}{space 1}   -2.26{col 55}{space 3}0.024{col 63}{space 4}-3.413669{col 76}{space 3}-.2436772
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  15.411
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.4222
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.207
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  18.213
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.1972
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. ********************************************************************************
. * Dependent Variable: TFP (Annual % Growth) * 
. 
. // Panel A, column 11
. reg mean_tfpgrowth_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 32,783.068)

Linear regression                               Number of obs     = {res}       115
                                                {txt}F(1, 113)         =  {res}     0.21
                                                {txt}Prob > F          = {res}    0.6487
                                                {txt}R-squared         = {res}    0.0112
                                                {txt}Root MSE          =    {res} 2.3465

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_tfpgrowt~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} .3425691{col 32}{space 2} .7499727{col 43}{space 1}    0.46{col 52}{space 3}0.649{col 60}{space 4}-1.143262{col 73}{space 3}   1.8284
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-1.399918{col 32}{space 2} .9255515{col 43}{space 1}   -1.51{col 52}{space 3}0.133{col 60}{space 4}-3.233603{col 73}{space 3} .4337663
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 12
. reg mean_tfpgrowth_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 32,783.068)

Linear regression                               Number of obs     = {res}       115
                                                {txt}F(6, 108)         =  {res}     0.96
                                                {txt}Prob > F          = {res}    0.4581
                                                {txt}R-squared         = {res}    0.1247
                                                {txt}Root MSE          =    {res} 2.2582

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_tfpgrowth_2~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}  .546707{col 35}{space 2} .7244098{col 46}{space 1}    0.75{col 55}{space 3}0.452{col 63}{space 4}-.8891988{col 76}{space 3} 1.982613
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}  .039885{col 35}{space 2} .0331616{col 46}{space 1}    1.20{col 55}{space 3}0.232{col 63}{space 4}-.0258469{col 76}{space 3}  .105617
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}  .186878{col 35}{space 2} .0937845{col 46}{space 1}    1.99{col 55}{space 3}0.049{col 63}{space 4} .0009809{col 76}{space 3} .3727752
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0088041{col 35}{space 2} .0088877{col 46}{space 1}   -0.99{col 55}{space 3}0.324{col 63}{space 4} -.026421{col 76}{space 3} .0088128
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0003866{col 35}{space 2} .0009398{col 46}{space 1}   -0.41{col 55}{space 3}0.682{col 63}{space 4}-.0022495{col 76}{space 3} .0014763
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} .0038893{col 35}{space 2} .1048868{col 46}{space 1}    0.04{col 55}{space 3}0.970{col 63}{space 4}-.2040145{col 76}{space 3}  .211793
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-4.502632{col 35}{space 2}  3.25995{col 46}{space 1}   -1.38{col 55}{space 3}0.170{col 63}{space 4}-10.96442{col 76}{space 3} 1.959154
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 11
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6200e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      55
{txt}{col 55}F(  1,    53) = {res}    0.32
{txt}{col 55}Prob > F      = {res}  0.5719
{txt}Total (centered) SS     = {res} 311.1345081{txt}{col 55}Centered R2   = {res}  0.1056
{txt}Total (uncentered) SS   = {res} 394.1094222{txt}{col 55}Uncentered R2 = {res}  0.2939
{txt}Residual SS             = {res}  278.272807{txt}{col 55}Root MSE      = {res}   2.249

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_tfpgrowt~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}  .503185{col 32}{space 2} .8683107{col 43}{space 1}    0.58{col 52}{space 3}0.562{col 60}{space 4}-1.198673{col 73}{space 3} 2.205043
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-1.697677{col 32}{space 2} 1.149401{col 43}{space 1}   -1.48{col 52}{space 3}0.140{col 60}{space 4}-3.950461{col 73}{space 3} .5551066
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.591
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1075
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.008
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 12
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6200e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      55
{txt}{col 55}F(  7,    47) = {res}    0.75
{txt}{col 55}Prob > F      = {res}  0.6279
{txt}Total (centered) SS     = {res} 311.1345081{txt}{col 55}Centered R2   = {res} -0.3535
{txt}Total (uncentered) SS   = {res} 394.1094222{txt}{col 55}Uncentered R2 = {res} -0.0686
{txt}Residual SS             = {res} 421.1329974{txt}{col 55}Root MSE      = {res}   2.767

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_tfpgrowth_2~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 7.054123{col 35}{space 2} 8.910956{col 46}{space 1}    0.79{col 55}{space 3}0.429{col 63}{space 4}-10.41103{col 76}{space 3} 24.51927
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0003059{col 35}{space 2} .0004808{col 46}{space 1}   -0.64{col 55}{space 3}0.525{col 63}{space 4}-.0012482{col 76}{space 3} .0006364
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.7919525{col 35}{space 2} 1.066042{col 46}{space 1}   -0.74{col 55}{space 3}0.458{col 63}{space 4}-2.881356{col 76}{space 3} 1.297451
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-1.091388{col 35}{space 2} 1.505971{col 46}{space 1}   -0.72{col 55}{space 3}0.469{col 63}{space 4}-4.043037{col 76}{space 3} 1.860261
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0660015{col 35}{space 2} .1054298{col 46}{space 1}   -0.63{col 55}{space 3}0.531{col 63}{space 4}  -.27264{col 76}{space 3}  .140637
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0021699{col 35}{space 2} .0034887{col 46}{space 1}    0.62{col 55}{space 3}0.534{col 63}{space 4}-.0046678{col 76}{space 3} .0090075
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0303614{col 35}{space 2} .1974871{col 46}{space 1}   -0.15{col 55}{space 3}0.878{col 63}{space 4} -.417429{col 76}{space 3} .3567062
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 43.49073{col 35}{space 2} 60.70233{col 46}{space 1}    0.72{col 55}{space 3}0.474{col 63}{space 4}-75.48365{col 76}{space 3} 162.4651
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.365
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.5456
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.302
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 11
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6310e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      61
{txt}{col 55}F(  1,    59) = {res}    4.81
{txt}{col 55}Prob > F      = {res}  0.0323
{txt}Total (centered) SS     = {res} 355.4725505{txt}{col 55}Centered R2   = {res}  0.1303
{txt}Total (uncentered) SS   = {res} 451.2031677{txt}{col 55}Uncentered R2 = {res}  0.3149
{txt}Residual SS             = {res}   309.14127{txt}{col 55}Root MSE      = {res}   2.251

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_tfpgrowt~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} 1.593869{col 32}{space 2} .7147676{col 43}{space 1}    2.23{col 52}{space 3}0.026{col 60}{space 4}   .19295{col 73}{space 3} 2.994787
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.730727{col 32}{space 2} .8467169{col 43}{space 1}   -3.23{col 52}{space 3}0.001{col 60}{space 4}-4.390262{col 73}{space 3}-1.071193
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.765
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0963
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  10.621
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 12
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6310e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      61
{txt}{col 55}F(  7,    53) = {res}    3.43
{txt}{col 55}Prob > F      = {res}  0.0043
{txt}Total (centered) SS     = {res} 355.4725505{txt}{col 55}Centered R2   = {res} -0.1384
{txt}Total (uncentered) SS   = {res} 451.2031677{txt}{col 55}Uncentered R2 = {res}  0.1031
{txt}Residual SS             = {res} 404.6834521{txt}{col 55}Root MSE      = {res}   2.576

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_tfpgrowth_2~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 6.303326{col 35}{space 2} 2.538951{col 46}{space 1}    2.48{col 55}{space 3}0.013{col 63}{space 4} 1.327073{col 76}{space 3} 11.27958
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0002655{col 35}{space 2} .0001406{col 46}{space 1}   -1.89{col 55}{space 3}0.059{col 63}{space 4} -.000541{col 76}{space 3}   .00001
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.6954616{col 35}{space 2} .4525687{col 46}{space 1}   -1.54{col 55}{space 3}0.124{col 63}{space 4} -1.58248{col 76}{space 3} .1915569
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.9562838{col 35}{space 2} .6264438{col 46}{space 1}   -1.53{col 55}{space 3}0.127{col 63}{space 4}-2.184091{col 76}{space 3} .2715234
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0564856{col 35}{space 2} .0338886{col 46}{space 1}   -1.67{col 55}{space 3}0.096{col 63}{space 4} -.122906{col 76}{space 3} .0099348
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0018965{col 35}{space 2} .0006661{col 46}{space 1}    2.85{col 55}{space 3}0.004{col 63}{space 4} .0005911{col 76}{space 3}  .003202
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0391275{col 35}{space 2} .1828433{col 46}{space 1}   -0.21{col 55}{space 3}0.831{col 63}{space 4}-.3974938{col 76}{space 3} .3192388
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}  38.1447{col 35}{space 2} 21.32928{col 46}{space 1}    1.79{col 55}{space 3}0.074{col 63}{space 4}-3.659912{col 76}{space 3} 79.94932
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.873
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0154
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   9.144
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 11
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6316e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      63
{txt}{col 55}F(  1,    61) = {res}    0.06
{txt}{col 55}Prob > F      = {res}  0.8072
{txt}Total (centered) SS     = {res} 367.0432244{txt}{col 55}Centered R2   = {res} -0.1136
{txt}Total (uncentered) SS   = {res} 466.0160566{txt}{col 55}Uncentered R2 = {res}  0.1229
{txt}Residual SS             = {res} 408.7319091{txt}{col 55}Root MSE      = {res}   2.547

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_tfpgrowt~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-.3626885{col 32}{space 2} 1.456436{col 43}{space 1}   -0.25{col 52}{space 3}0.803{col 60}{space 4}-3.217251{col 73}{space 3} 2.491874
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-.9171189{col 32}{space 2} 1.769829{col 43}{space 1}   -0.52{col 52}{space 3}0.604{col 60}{space 4} -4.38592{col 73}{space 3} 2.551682
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.267
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1322
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   5.221
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 12
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6316e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      63
{txt}{col 55}F(  7,    55) = {res}    0.01
{txt}{col 55}Prob > F      = {res}  1.0000
{txt}Total (centered) SS     = {res} 367.0432244{txt}{col 55}Centered R2   = {res}-1.2e+02
{txt}Total (uncentered) SS   = {res} 466.0160566{txt}{col 55}Uncentered R2 = {res}-95.1046
{txt}Residual SS             = {res} 44786.26861{txt}{col 55}Root MSE      = {res}   26.66

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_tfpgrowth_2~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} -63.7546{col 35}{space 2}  369.543{col 46}{space 1}   -0.17{col 55}{space 3}0.863{col 63}{space 4}-788.0456{col 76}{space 3} 660.5364
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}  .003457{col 35}{space 2} .0194338{col 46}{space 1}    0.18{col 55}{space 3}0.859{col 63}{space 4}-.0346325{col 76}{space 3} .0415465
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} 7.562733{col 35}{space 2} 43.25637{col 46}{space 1}    0.17{col 55}{space 3}0.861{col 63}{space 4}-77.21819{col 76}{space 3} 92.34366
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} 10.97012{col 35}{space 2} 63.10399{col 46}{space 1}    0.17{col 55}{space 3}0.862{col 63}{space 4}-112.7114{col 76}{space 3} 134.6517
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .7294848{col 35}{space 2} 4.083358{col 46}{space 1}    0.18{col 55}{space 3}0.858{col 63}{space 4}-7.273749{col 76}{space 3} 8.732719
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0241442{col 35}{space 2} .1394741{col 46}{space 1}   -0.17{col 55}{space 3}0.863{col 63}{space 4}-.2975084{col 76}{space 3}   .24922
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.4907182{col 35}{space 2}  2.69284{col 46}{space 1}   -0.18{col 55}{space 3}0.855{col 63}{space 4}-5.768588{col 76}{space 3} 4.787152
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-432.4458{col 35}{space 2} 2489.766{col 46}{space 1}   -0.17{col 55}{space 3}0.862{col 63}{space 4}-5312.298{col 76}{space 3} 4447.406
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.030
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8622
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.027
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 11
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2639e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     103
{txt}{col 55}F(  1,   101) = {res}    1.36
{txt}{col 55}Prob > F      = {res}  0.2467
{txt}Total (centered) SS     = {res}  560.935624{txt}{col 55}Centered R2   = {res} -0.0647
{txt}Total (uncentered) SS   = {res} 672.4929389{txt}{col 55}Uncentered R2 = {res}  0.1119
{txt}Residual SS             = {res}  597.214265{txt}{col 55}Root MSE      = {res}   2.408

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_tfpgrowt~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} 1.217614{col 32}{space 2} 1.034891{col 43}{space 1}    1.18{col 52}{space 3}0.239{col 60}{space 4}-.8107358{col 73}{space 3} 3.245963
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.285911{col 32}{space 2} 1.137576{col 43}{space 1}   -2.01{col 52}{space 3}0.044{col 60}{space 4}-4.515519{col 73}{space 3}-.0563029
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   4.325
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.1151
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.526
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   1.511
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.2190
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 12
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2613e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     102
{txt}{col 55}F(  7,    94) = {res}    2.24
{txt}{col 55}Prob > F      = {res}  0.0373
{txt}Total (centered) SS     = {res} 554.3317346{txt}{col 55}Centered R2   = {res}  0.0819
{txt}Total (uncentered) SS   = {res} 665.5552576{txt}{col 55}Uncentered R2 = {res}  0.2353
{txt}Residual SS             = {res} 508.9560666{txt}{col 55}Root MSE      = {res}   2.234

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_tfpgrowth_2~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 1.391579{col 35}{space 2} 1.236119{col 46}{space 1}    1.13{col 55}{space 3}0.260{col 63}{space 4} -1.03117{col 76}{space 3} 3.814328
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2} 8.43e-06{col 35}{space 2} .0000548{col 46}{space 1}    0.15{col 55}{space 3}0.878{col 63}{space 4} -.000099{col 76}{space 3} .0001158
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0431089{col 35}{space 2} .0588003{col 46}{space 1}    0.73{col 55}{space 3}0.463{col 63}{space 4}-.0721376{col 76}{space 3} .1583554
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .1737348{col 35}{space 2} .1392666{col 46}{space 1}    1.25{col 55}{space 3}0.212{col 63}{space 4}-.0992227{col 76}{space 3} .4466923
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0091757{col 35}{space 2} .0083293{col 46}{space 1}   -1.10{col 55}{space 3}0.271{col 63}{space 4}-.0255009{col 76}{space 3} .0071495
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0000501{col 35}{space 2} .0007918{col 46}{space 1}    0.06{col 55}{space 3}0.950{col 63}{space 4}-.0015017{col 76}{space 3}  .001602
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0876967{col 35}{space 2} .1031286{col 46}{space 1}   -0.85{col 55}{space 3}0.395{col 63}{space 4} -.289825{col 76}{space 3} .1144316
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-2.384992{col 35}{space 2} 3.723514{col 46}{space 1}   -0.64{col 55}{space 3}0.522{col 63}{space 4}-9.682945{col 76}{space 3} 4.912961
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   7.111
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0286
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   6.868
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.749
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.3868
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 11 
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2621e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     101
{txt}{col 55}F(  1,    99) = {res}    1.83
{txt}{col 55}Prob > F      = {res}  0.1791
{txt}Total (centered) SS     = {res} 550.0634098{txt}{col 55}Centered R2   = {res} -0.0352
{txt}Total (uncentered) SS   = {res} 659.3263785{txt}{col 55}Uncentered R2 = {res}  0.1364
{txt}Residual SS             = {res} 569.4266418{txt}{col 55}Root MSE      = {res}   2.374

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_tfpgrowt~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} 1.024211{col 32}{space 2} .7493854{col 43}{space 1}    1.37{col 52}{space 3}0.172{col 60}{space 4}-.4445574{col 73}{space 3} 2.492979
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.087911{col 32}{space 2}  .903557{col 43}{space 1}   -2.31{col 52}{space 3}0.021{col 60}{space 4}-3.858851{col 73}{space 3}-.3169721
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  15.627
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.1108
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.972
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   9.304
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.4097
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 12
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.2595e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     100
{txt}{col 55}F(  7,    92) = {res}    1.05
{txt}{col 55}Prob > F      = {res}  0.4025
{txt}Total (centered) SS     = {res} 543.4818354{txt}{col 55}Centered R2   = {res} -0.1483
{txt}Total (uncentered) SS   = {res} 652.3974725{txt}{col 55}Uncentered R2 = {res}  0.0434
{txt}Residual SS             = {res}  624.076794{txt}{col 55}Root MSE      = {res}   2.498

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_tfpgrowth_2~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 2.742364{col 35}{space 2} 1.262356{col 46}{space 1}    2.17{col 55}{space 3}0.030{col 63}{space 4} .2681911{col 76}{space 3} 5.216536
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000326{col 35}{space 2} .0000469{col 46}{space 1}   -0.70{col 55}{space 3}0.487{col 63}{space 4}-.0001244{col 76}{space 3} .0000593
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} .0091211{col 35}{space 2} .0492527{col 46}{space 1}    0.19{col 55}{space 3}0.853{col 63}{space 4}-.0874125{col 76}{space 3} .1056547
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .1043778{col 35}{space 2} .1032341{col 46}{space 1}    1.01{col 55}{space 3}0.312{col 63}{space 4}-.0979573{col 76}{space 3} .3067129
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0111596{col 35}{space 2} .0113533{col 46}{space 1}   -0.98{col 55}{space 3}0.326{col 63}{space 4}-.0334117{col 76}{space 3} .0110925
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0005937{col 35}{space 2} .0008306{col 46}{space 1}    0.71{col 55}{space 3}0.475{col 63}{space 4}-.0010343{col 76}{space 3} .0022216
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.1209328{col 35}{space 2} .1325541{col 46}{space 1}   -0.91{col 55}{space 3}0.362{col 63}{space 4} -.380734{col 76}{space 3} .1388684
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} .5836577{col 35}{space 2} 4.105952{col 46}{space 1}    0.14{col 55}{space 3}0.887{col 63}{space 4} -7.46386{col 76}{space 3} 8.631175
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   9.294
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.5044
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.620
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  10.378
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.3208
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 11 
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6193e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      53
{txt}{col 55}F(  1,    51) = {res}   11.29
{txt}{col 55}Prob > F      = {res}  0.0015
{txt}Total (centered) SS     = {res} 299.8863614{txt}{col 55}Centered R2   = {res}  0.1481
{txt}Total (uncentered) SS   = {res} 379.7567113{txt}{col 55}Uncentered R2 = {res}  0.3273
{txt}Residual SS             = {res} 255.4773678{txt}{col 55}Root MSE      = {res}   2.196

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_tfpgrowt~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} 1.271184{col 32}{space 2}   .37114{col 43}{space 1}    3.43{col 52}{space 3}0.001{col 60}{space 4} .5437628{col 73}{space 3} 1.998605
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-2.413619{col 32}{space 2} .5360758{col 43}{space 1}   -4.50{col 52}{space 3}0.000{col 60}{space 4}-3.464308{col 73}{space 3} -1.36293
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  20.456
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.1551
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  63.650
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  13.699
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.4723
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 12
. ivreg2 mean_tfpgrowth_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6193e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      53
{txt}{col 55}F(  7,    45) = {res}   12.68
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 299.8863614{txt}{col 55}Centered R2   = {res}  0.2659
{txt}Total (uncentered) SS   = {res} 379.7567113{txt}{col 55}Uncentered R2 = {res}  0.4203
{txt}Residual SS             = {res} 220.1348169{txt}{col 55}Root MSE      = {res}   2.038

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_tfpgrowth_2~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 2.999566{col 35}{space 2} .7839131{col 46}{space 1}    3.83{col 55}{space 3}0.000{col 63}{space 4} 1.463124{col 76}{space 3} 4.536007
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0000853{col 35}{space 2} .0000518{col 46}{space 1}   -1.64{col 55}{space 3}0.100{col 63}{space 4}-.0001869{col 76}{space 3} .0000164
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} -.285236{col 35}{space 2} .1806566{col 46}{space 1}   -1.58{col 55}{space 3}0.114{col 63}{space 4}-.6393165{col 76}{space 3} .0688445
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-.3813744{col 35}{space 2} .2258479{col 46}{space 1}   -1.69{col 55}{space 3}0.091{col 63}{space 4}-.8240281{col 76}{space 3} .0612793
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0161086{col 35}{space 2} .0170329{col 46}{space 1}   -0.95{col 55}{space 3}0.344{col 63}{space 4}-.0494925{col 76}{space 3} .0172753
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .0006916{col 35}{space 2}  .000725{col 46}{space 1}    0.95{col 55}{space 3}0.340{col 63}{space 4}-.0007294{col 76}{space 3} .0021125
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.0911192{col 35}{space 2} .1556786{col 46}{space 1}   -0.59{col 55}{space 3}0.558{col 63}{space 4}-.3962436{col 76}{space 3} .2140052
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 15.78929{col 35}{space 2} 7.040614{col 46}{space 1}    2.24{col 55}{space 3}0.025{col 63}{space 4} 1.989938{col 76}{space 3} 29.58864
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  13.813
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.5398
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  19.057
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  12.338
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.5792
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. ********************************************************************************
. * Dependent Variable: Import Value Index (2000=100) * 
. 
. // Panel A, column 13
. reg mean_import_value_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,367.166)

Linear regression                               Number of obs     = {res}       163
                                                {txt}F(1, 161)         =  {res}    43.26
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5802
                                                {txt}Root MSE          =    {res} 69.096

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_import_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-105.2522{col 32}{space 2} 16.00287{col 43}{space 1}   -6.58{col 52}{space 3}0.000{col 60}{space 4}-136.8548{col 73}{space 3}-73.64958
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 318.4125{col 32}{space 2} 20.70321{col 43}{space 1}   15.38{col 52}{space 3}0.000{col 60}{space 4} 277.5277{col 73}{space 3} 359.2974
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 14
. reg mean_import_value_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,367.166)

Linear regression                               Number of obs     = {res}       163
                                                {txt}F(6, 156)         =  {res}     6.19
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.5932
                                                {txt}Root MSE          =    {res} 69.104

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_import_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} -97.8315{col 35}{space 2} 26.72751{col 46}{space 1}   -3.66{col 55}{space 3}0.000{col 63}{space 4} -150.626{col 76}{space 3}-45.03698
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} 1.413924{col 35}{space 2} 1.349229{col 46}{space 1}    1.05{col 55}{space 3}0.296{col 63}{space 4} -1.25119{col 76}{space 3} 4.079039
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} 1.090929{col 35}{space 2} 2.627667{col 46}{space 1}    0.42{col 55}{space 3}0.679{col 63}{space 4}-4.099469{col 76}{space 3} 6.281327
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .0850058{col 35}{space 2} .2338453{col 46}{space 1}    0.36{col 55}{space 3}0.717{col 63}{space 4}-.3769058{col 76}{space 3} .5469175
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0050418{col 35}{space 2} .0254919{col 46}{space 1}   -0.20{col 55}{space 3}0.843{col 63}{space 4}-.0553957{col 76}{space 3} .0453121
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-2.895356{col 35}{space 2} 3.372604{col 46}{space 1}   -0.86{col 55}{space 3}0.392{col 63}{space 4}-9.557218{col 76}{space 3} 3.766507
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 340.2923{col 35}{space 2} 98.31988{col 46}{space 1}    3.46{col 55}{space 3}0.001{col 63}{space 4} 146.0822{col 76}{space 3} 534.5023
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 13
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  1,    75) = {res}   56.28
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1350441.066{txt}{col 55}Centered R2   = {res}  0.5908
{txt}Total (uncentered) SS   = {res} 5238345.207{txt}{col 55}Uncentered R2 = {res}  0.8945
{txt}Residual SS             = {res} 552556.5093{txt}{col 55}Root MSE      = {res}   84.71

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_import_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-148.4746{col 32}{space 2} 19.53176{col 43}{space 1}   -7.60{col 52}{space 3}0.000{col 60}{space 4}-186.7561{col 73}{space 3}-110.1931
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 358.3488{col 32}{space 2} 29.01471{col 43}{space 1}   12.35{col 52}{space 3}0.000{col 60}{space 4}  301.481{col 73}{space 3} 415.2166
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.041
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0812
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   9.907
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 14
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  7,    69) = {res}   19.90
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1350441.066{txt}{col 55}Centered R2   = {res}  0.7376
{txt}Total (uncentered) SS   = {res} 5238345.207{txt}{col 55}Uncentered R2 = {res}  0.9323
{txt}Residual SS             = {res}  354412.841{txt}{col 55}Root MSE      = {res}   67.84

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_import_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-44.73517{col 35}{space 2} 170.6739{col 46}{space 1}   -0.26{col 55}{space 3}0.793{col 63}{space 4}-379.2499{col 76}{space 3} 289.7796
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0078612{col 35}{space 2} .0088398{col 46}{space 1}   -0.89{col 55}{space 3}0.374{col 63}{space 4}-.0251868{col 76}{space 3} .0094645
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-6.947433{col 35}{space 2} 13.80756{col 46}{space 1}   -0.50{col 55}{space 3}0.615{col 63}{space 4}-34.00976{col 76}{space 3}  20.1149
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-5.629993{col 35}{space 2} 21.85817{col 46}{space 1}   -0.26{col 55}{space 3}0.797{col 63}{space 4}-48.47122{col 76}{space 3} 37.21123
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-1.029695{col 35}{space 2} 1.598944{col 46}{space 1}   -0.64{col 55}{space 3}0.520{col 63}{space 4}-4.163567{col 76}{space 3} 2.104178
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0013159{col 35}{space 2}  .084686{col 46}{space 1}   -0.02{col 55}{space 3}0.988{col 63}{space 4}-.1672975{col 76}{space 3} .1646656
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 11.04959{col 35}{space 2}  6.77226{col 46}{space 1}    1.63{col 55}{space 3}0.103{col 63}{space 4}-2.223801{col 76}{space 3} 24.32297
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 470.7585{col 35}{space 2} 984.4532{col 46}{space 1}    0.48{col 55}{space 3}0.633{col 63}{space 4}-1458.734{col 76}{space 3} 2400.251
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.565
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.4522
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.479
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 13
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6690e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      89
{txt}{col 55}F(  1,    87) = {res}   16.73
{txt}{col 55}Prob > F      = {res}  0.0001
{txt}Total (centered) SS     = {res} 1554373.013{txt}{col 55}Centered R2   = {res}  0.5605
{txt}Total (uncentered) SS   = {res} 6056927.284{txt}{col 55}Uncentered R2 = {res}  0.8872
{txt}Residual SS             = {res} 683146.7216{txt}{col 55}Root MSE      = {res}   87.61

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_import_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-152.1608{col 32}{space 2} 36.78421{col 43}{space 1}   -4.14{col 52}{space 3}0.000{col 60}{space 4}-224.2565{col 73}{space 3}-80.06505
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 360.0319{col 32}{space 2} 44.23448{col 43}{space 1}    8.14{col 52}{space 3}0.000{col 60}{space 4} 273.3339{col 73}{space 3} 446.7299
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.531
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0602
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.119
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 14
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6690e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      89
{txt}{col 55}F(  7,    81) = {res}   19.99
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1554373.013{txt}{col 55}Centered R2   = {res}  0.5793
{txt}Total (uncentered) SS   = {res} 6056927.284{txt}{col 55}Uncentered R2 = {res}  0.8920
{txt}Residual SS             = {res}  653898.902{txt}{col 55}Root MSE      = {res}   85.72

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_import_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-167.6003{col 35}{space 2} 78.41528{col 46}{space 1}   -2.14{col 55}{space 3}0.033{col 63}{space 4}-321.2914{col 76}{space 3}-13.90917
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0018455{col 35}{space 2} .0039007{col 46}{space 1}   -0.47{col 55}{space 3}0.636{col 63}{space 4}-.0094907{col 76}{space 3} .0057998
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} 3.909184{col 35}{space 2} 11.53128{col 46}{space 1}    0.34{col 55}{space 3}0.735{col 63}{space 4}-18.69172{col 76}{space 3} 26.51008
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} 11.79916{col 35}{space 2} 17.60165{col 46}{space 1}    0.67{col 55}{space 3}0.503{col 63}{space 4}-22.69944{col 76}{space 3} 46.29776
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} .1448198{col 35}{space 2}  .879444{col 46}{space 1}    0.16{col 55}{space 3}0.869{col 63}{space 4}-1.578859{col 76}{space 3} 1.868498
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0558963{col 35}{space 2} .0253728{col 46}{space 1}   -2.20{col 55}{space 3}0.028{col 63}{space 4}-.1056261{col 76}{space 3}-.0061665
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 14.29144{col 35}{space 2}  5.44691{col 46}{space 1}    2.62{col 55}{space 3}0.009{col 63}{space 4} 3.615689{col 76}{space 3} 24.96718
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-301.6671{col 35}{space 2} 632.4225{col 46}{space 1}   -0.48{col 55}{space 3}0.633{col 63}{space 4}-1541.193{col 76}{space 3} 937.8583
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   6.155
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0131
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  12.186
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 13
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6698e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      93
{txt}{col 55}F(  1,    91) = {res}   23.91
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1623940.845{txt}{col 55}Centered R2   = {res}  0.6067
{txt}Total (uncentered) SS   = {res} 6329275.715{txt}{col 55}Uncentered R2 = {res}  0.8991
{txt}Residual SS             = {res} 638715.6314{txt}{col 55}Root MSE      = {res}   82.87

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_import_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-122.8848{col 32}{space 2} 24.86032{col 43}{space 1}   -4.94{col 52}{space 3}0.000{col 60}{space 4}-171.6101{col 73}{space 3}-74.15942
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 334.0158{col 32}{space 2} 24.62684{col 43}{space 1}   13.56{col 52}{space 3}0.000{col 60}{space 4} 285.7481{col 73}{space 3} 382.2835
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.573
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1087
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   6.176
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 14
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6698e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      93
{txt}{col 55}F(  7,    85) = {res}    0.08
{txt}{col 55}Prob > F      = {res}  0.9990
{txt}Total (centered) SS     = {res} 1623940.845{txt}{col 55}Centered R2   = {res}-36.2301
{txt}Total (uncentered) SS   = {res} 6329275.715{txt}{col 55}Uncentered R2 = {res} -8.5524
{txt}Residual SS             = {res} 60459543.73{txt}{col 55}Root MSE      = {res}   806.3

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_import_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 1730.639{col 35}{space 2} 6961.038{col 46}{space 1}    0.25{col 55}{space 3}0.804{col 63}{space 4}-11912.74{col 76}{space 3} 15374.02
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0962751{col 35}{space 2}  .341663{col 46}{space 1}   -0.28{col 55}{space 3}0.778{col 63}{space 4}-.7659223{col 76}{space 3} .5733721
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-166.5542{col 35}{space 2}  615.762{col 46}{space 1}   -0.27{col 55}{space 3}0.787{col 63}{space 4}-1373.425{col 76}{space 3} 1040.317
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-259.9426{col 35}{space 2}  998.464{col 46}{space 1}   -0.26{col 55}{space 3}0.795{col 63}{space 4}-2216.896{col 76}{space 3} 1697.011
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-17.98925{col 35}{space 2} 65.04587{col 46}{space 1}   -0.28{col 55}{space 3}0.782{col 63}{space 4}-145.4768{col 76}{space 3} 109.4983
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}   .77751{col 35}{space 2} 3.124038{col 46}{space 1}    0.25{col 55}{space 3}0.803{col 63}{space 4}-5.345492{col 76}{space 3} 6.900512
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-26.69968{col 35}{space 2} 184.8506{col 46}{space 1}   -0.14{col 55}{space 3}0.885{col 63}{space 4}-389.0001{col 76}{space 3} 335.6008
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 11486.66{col 35}{space 2}  43344.2{col 46}{space 1}    0.27{col 55}{space 3}0.791{col 63}{space 4}-73466.41{col 76}{space 3} 96439.74
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.057
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8105
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.054
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 13
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3074e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     136
{txt}{col 55}F(  1,   134) = {res}   22.65
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res}   1468884.9{txt}{col 55}Centered R2   = {res}  0.5367
{txt}Total (uncentered) SS   = {res} 7640453.814{txt}{col 55}Uncentered R2 = {res}  0.9109
{txt}Residual SS             = {res} 680601.8156{txt}{col 55}Root MSE      = {res}   70.74

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_import_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-134.7966{col 32}{space 2} 28.11151{col 43}{space 1}   -4.80{col 52}{space 3}0.000{col 60}{space 4}-189.8942{col 73}{space 3} -79.6991
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 347.3689{col 32}{space 2} 32.73784{col 43}{space 1}   10.61{col 52}{space 3}0.000{col 60}{space 4} 283.2039{col 73}{space 3} 411.5339
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.099
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0781
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.878
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   1.428
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.2321
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 14
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3048e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     135
{txt}{col 55}F(  7,   127) = {res}   45.18
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1458638.463{txt}{col 55}Centered R2   = {res}  0.6609
{txt}Total (uncentered) SS   = {res} 7581476.236{txt}{col 55}Uncentered R2 = {res}  0.9348
{txt}Residual SS             = {res} 494659.3825{txt}{col 55}Root MSE      = {res}   60.53

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_import_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-111.4686{col 35}{space 2} 23.53284{col 46}{space 1}   -4.74{col 55}{space 3}0.000{col 63}{space 4}-157.5921{col 76}{space 3}-65.34506
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0032465{col 35}{space 2} .0008235{col 46}{space 1}   -3.94{col 55}{space 3}0.000{col 63}{space 4}-.0048605{col 76}{space 3}-.0016326
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.7682601{col 35}{space 2} 1.219175{col 46}{space 1}   -0.63{col 55}{space 3}0.529{col 63}{space 4}-3.157799{col 76}{space 3} 1.621279
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-1.281514{col 35}{space 2} 2.645487{col 46}{space 1}   -0.48{col 55}{space 3}0.628{col 63}{space 4}-6.466573{col 76}{space 3} 3.903546
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.0300882{col 35}{space 2}  .186689{col 46}{space 1}   -0.16{col 55}{space 3}0.872{col 63}{space 4}-.3959919{col 76}{space 3} .3358155
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0192046{col 35}{space 2} .0161609{col 46}{space 1}   -1.19{col 55}{space 3}0.235{col 63}{space 4}-.0508794{col 76}{space 3} .0124703
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 4.912413{col 35}{space 2} 2.476897{col 46}{space 1}    1.98{col 55}{space 3}0.047{col 63}{space 4} .0577833{col 76}{space 3} 9.767043
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 284.7704{col 35}{space 2} 70.34123{col 46}{space 1}    4.05{col 55}{space 3}0.000{col 63}{space 4} 146.9041{col 76}{space 3} 422.6367
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   7.757
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0207
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.565
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.627
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.4286
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 13 
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3159e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     142
{txt}{col 55}F(  1,   140) = {res}   22.94
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1568319.256{txt}{col 55}Centered R2   = {res}  0.4949
{txt}Total (uncentered) SS   = {res} 8053704.533{txt}{col 55}Uncentered R2 = {res}  0.9017
{txt}Residual SS             = {res}  792081.046{txt}{col 55}Root MSE      = {res}   74.69

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_import_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2} -146.032{col 32}{space 2} 30.27207{col 43}{space 1}   -4.82{col 52}{space 3}0.000{col 60}{space 4}-205.3642{col 73}{space 3}-86.69983
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 358.2638{col 32}{space 2} 36.44303{col 43}{space 1}    9.83{col 52}{space 3}0.000{col 60}{space 4} 286.8368{col 73}{space 3} 429.6908
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  19.148
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.0384
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   4.478
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   9.798
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.3671
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 14
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3134e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     141
{txt}{col 55}F(  7,   133) = {res}   42.77
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1557890.106{txt}{col 55}Centered R2   = {res}  0.6754
{txt}Total (uncentered) SS   = {res} 7994132.772{txt}{col 55}Uncentered R2 = {res}  0.9367
{txt}Residual SS             = {res} 505698.6011{txt}{col 55}Root MSE      = {res}   59.89

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_import_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-102.5585{col 35}{space 2} 24.43296{col 46}{space 1}   -4.20{col 55}{space 3}0.000{col 63}{space 4}-150.4462{col 76}{space 3}-54.67079
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0035198{col 35}{space 2} .0009592{col 46}{space 1}   -3.67{col 55}{space 3}0.000{col 63}{space 4}-.0053999{col 76}{space 3}-.0016398
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-.9996515{col 35}{space 2} .9451678{col 46}{space 1}   -1.06{col 55}{space 3}0.290{col 63}{space 4}-2.852146{col 76}{space 3} .8528433
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-1.706972{col 35}{space 2} 2.036864{col 46}{space 1}   -0.84{col 55}{space 3}0.402{col 63}{space 4}-5.699153{col 76}{space 3} 2.285209
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}  -.02706{col 35}{space 2} .1914832{col 46}{space 1}   -0.14{col 55}{space 3}0.888{col 63}{space 4}-.4023601{col 76}{space 3} .3482401
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} -.016301{col 35}{space 2} .0228837{col 46}{space 1}   -0.71{col 55}{space 3}0.476{col 63}{space 4}-.0611523{col 76}{space 3} .0285502
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 4.689474{col 35}{space 2} 2.793206{col 46}{space 1}    1.68{col 55}{space 3}0.093{col 63}{space 4}  -.78511{col 76}{space 3} 10.16406
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 303.4419{col 35}{space 2} 83.04024{col 46}{space 1}    3.65{col 55}{space 3}0.000{col 63}{space 4}  140.686{col 76}{space 3} 466.1978
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.747
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.3775
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.733
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  12.714
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.1760
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 13 
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  1,    71) = {res}   95.07
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res}  1247337.38{txt}{col 55}Centered R2   = {res}  0.6054
{txt}Total (uncentered) SS   = {res} 4897369.428{txt}{col 55}Uncentered R2 = {res}  0.8995
{txt}Residual SS             = {res} 492214.5599{txt}{col 55}Root MSE      = {res}   82.11

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_import_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-135.0968{col 32}{space 2}  13.6647{col 43}{space 1}   -9.89{col 52}{space 3}0.000{col 60}{space 4}-161.8792{col 73}{space 3}-108.3145
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 345.9621{col 32}{space 2} 23.28457{col 43}{space 1}   14.86{col 52}{space 3}0.000{col 60}{space 4} 300.3252{col 73}{space 3}  391.599
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  21.884
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.1109
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  84.236
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  10.715
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.7082
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 14
. ivreg2 mean_import_value_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  7,    65) = {res}  115.87
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res}  1247337.38{txt}{col 55}Centered R2   = {res}  0.7266
{txt}Total (uncentered) SS   = {res} 4897369.428{txt}{col 55}Uncentered R2 = {res}  0.9304
{txt}Residual SS             = {res}  341031.853{txt}{col 55}Root MSE      = {res}   68.35

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_import_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-87.71439{col 35}{space 2} 20.06267{col 46}{space 1}   -4.37{col 55}{space 3}0.000{col 63}{space 4}-127.0365{col 76}{space 3}-48.39227
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0056334{col 35}{space 2} .0012148{col 46}{space 1}   -4.64{col 55}{space 3}0.000{col 63}{space 4}-.0080144{col 76}{space 3}-.0032524
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-3.171446{col 35}{space 2} 4.028651{col 46}{space 1}   -0.79{col 55}{space 3}0.431{col 63}{space 4}-11.06746{col 76}{space 3} 4.724565
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .3730773{col 35}{space 2} 5.779533{col 46}{space 1}    0.06{col 55}{space 3}0.949{col 63}{space 4} -10.9546{col 76}{space 3} 11.70075
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2} -.645815{col 35}{space 2} .3831676{col 46}{space 1}   -1.69{col 55}{space 3}0.092{col 63}{space 4} -1.39681{col 76}{space 3} .1051797
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0196322{col 35}{space 2} .0256888{col 46}{space 1}   -0.76{col 55}{space 3}0.445{col 63}{space 4}-.0699813{col 76}{space 3}  .030717
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 11.62009{col 35}{space 2}  5.68808{col 46}{space 1}    2.04{col 55}{space 3}0.041{col 63}{space 4} .4716586{col 76}{space 3} 22.76852
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 219.1168{col 35}{space 2} 225.5213{col 46}{space 1}    0.97{col 55}{space 3}0.331{col 63}{space 4}-222.8968{col 76}{space 3} 661.1304
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  15.411
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.4222
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.207
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  15.965
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.3155
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. ********************************************************************************
. * Dependent Variable: Export Value Index (2000=100) * 
. 
. // Panel A, column 15
. reg mean_export_value_2001_2019 democracy_vdem2000 [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,367.166)

Linear regression                               Number of obs     = {res}       163
                                                {txt}F(1, 161)         =  {res}    17.01
                                                {txt}Prob > F          = {res}    0.0001
                                                {txt}R-squared         = {res}    0.4650
                                                {txt}Root MSE          =    {res} 84.132

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_export_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-101.6199{col 32}{space 2} 24.64044{col 43}{space 1}   -4.12{col 52}{space 3}0.000{col 60}{space 4}  -150.28{col 73}{space 3}-52.95971
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}  310.389{col 32}{space 2} 30.64173{col 43}{space 1}   10.13{col 52}{space 3}0.000{col 60}{space 4} 249.8774{col 73}{space 3} 370.9005
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel A, column 16
. reg mean_export_value_2001_2019 democracy_vdem2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000],robust
{txt}(analytic weights assumed)
(sum of wgt is 33,367.166)

Linear regression                               Number of obs     = {res}       163
                                                {txt}F(6, 156)         =  {res}     3.50
                                                {txt}Prob > F          = {res}    0.0028
                                                {txt}R-squared         = {res}    0.4822
                                                {txt}Root MSE          =    {res} 84.083

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_export_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      t{col 55}   P>|t|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-90.62587{col 35}{space 2} 36.83072{col 46}{space 1}   -2.46{col 55}{space 3}0.015{col 63}{space 4}-163.3771{col 76}{space 3}-17.87461
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2} 1.085949{col 35}{space 2} 1.751696{col 46}{space 1}    0.62{col 55}{space 3}0.536{col 63}{space 4}-2.374155{col 76}{space 3} 4.546053
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} .8699564{col 35}{space 2}  3.23088{col 46}{space 1}    0.27{col 55}{space 3}0.788{col 63}{space 4} -5.51196{col 76}{space 3} 7.251873
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.1210837{col 35}{space 2} .2925883{col 46}{space 1}   -0.41{col 55}{space 3}0.680{col 63}{space 4}-.6990297{col 76}{space 3} .4568622
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} -.000774{col 35}{space 2} .0212753{col 46}{space 1}   -0.04{col 55}{space 3}0.971{col 63}{space 4}-.0427989{col 76}{space 3} .0412508
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-3.069993{col 35}{space 2} 3.632275{col 46}{space 1}   -0.85{col 55}{space 3}0.399{col 63}{space 4}-10.24478{col 76}{space 3} 4.104794
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 365.3207{col 35}{space 2}  116.495{col 46}{space 1}    3.14{col 55}{space 3}0.002{col 63}{space 4} 135.2096{col 76}{space 3} 595.4319
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. // Panel B, column 15
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=logem4) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  1,    75) = {res}   56.24
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1501381.173{txt}{col 55}Centered R2   = {res}  0.5836
{txt}Total (uncentered) SS   = {res} 5401799.112{txt}{col 55}Uncentered R2 = {res}  0.8843
{txt}Residual SS             = {res} 625118.2435{txt}{col 55}Root MSE      = {res}    90.1

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_export_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-152.4263{col 32}{space 2} 20.05987{col 43}{space 1}   -7.60{col 52}{space 3}0.000{col 60}{space 4}-191.7429{col 73}{space 3}-113.1097
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 362.2671{col 32}{space 2} 27.80224{col 43}{space 1}   13.03{col 52}{space 3}0.000{col 60}{space 4} 307.7757{col 73}{space 3} 416.7585
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.041
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0812
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   9.907
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel B, column 16
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=logem4) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6528e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      77
{txt}{col 55}F(  7,    69) = {res}   53.66
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1501381.173{txt}{col 55}Centered R2   = {res}  0.6458
{txt}Total (uncentered) SS   = {res} 5401799.112{txt}{col 55}Uncentered R2 = {res}  0.9015
{txt}Residual SS             = {res} 531833.2678{txt}{col 55}Root MSE      = {res}   83.11

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_export_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-161.3786{col 35}{space 2} 231.6497{col 46}{space 1}   -0.70{col 55}{space 3}0.486{col 63}{space 4}-615.4036{col 76}{space 3} 292.6465
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0037074{col 35}{space 2} .0118351{col 46}{space 1}   -0.31{col 55}{space 3}0.754{col 63}{space 4}-.0269039{col 76}{space 3}  .019489
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}  .300708{col 35}{space 2} 20.32619{col 46}{space 1}    0.01{col 55}{space 3}0.988{col 63}{space 4}-39.53789{col 76}{space 3} 40.13931
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} 8.906746{col 35}{space 2} 32.38621{col 46}{space 1}    0.28{col 55}{space 3}0.783{col 63}{space 4}-54.56906{col 76}{space 3} 72.38255
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.1450938{col 35}{space 2} 2.098166{col 46}{space 1}   -0.07{col 55}{space 3}0.945{col 63}{space 4}-4.257423{col 76}{space 3} 3.967235
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0628034{col 35}{space 2} .1042262{col 46}{space 1}   -0.60{col 55}{space 3}0.547{col 63}{space 4}-.2670829{col 76}{space 3} .1414761
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 20.62967{col 35}{space 2} 7.726154{col 46}{space 1}    2.67{col 55}{space 3}0.008{col 63}{space 4}  5.48669{col 76}{space 3} 35.77266
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-290.1031{col 35}{space 2} 1404.819{col 46}{space 1}   -0.21{col 55}{space 3}0.836{col 63}{space 4}-3043.497{col 76}{space 3} 2463.291
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.565
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.4522
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.479
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4
{hline 78}

{com}. 
. // Panel C, column 15
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=lpd1500s) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6690e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      89
{txt}{col 55}F(  1,    87) = {res}   26.15
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1721511.904{txt}{col 55}Centered R2   = {res}  0.5713
{txt}Total (uncentered) SS   = {res} 6219227.351{txt}{col 55}Uncentered R2 = {res}  0.8813
{txt}Residual SS             = {res} 738069.3185{txt}{col 55}Root MSE      = {res}   91.07

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_export_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-143.7995{col 32}{space 2} 27.80049{col 43}{space 1}   -5.17{col 52}{space 3}0.000{col 60}{space 4}-198.2875{col 73}{space 3}-89.31155
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 352.4867{col 32}{space 2} 33.42879{col 43}{space 1}   10.54{col 52}{space 3}0.000{col 60}{space 4} 286.9675{col 73}{space 3}  418.006
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   3.531
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0602
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.119
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel C, column 16
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=lpd1500s) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6690e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      89
{txt}{col 55}F(  7,    81) = {res}  110.61
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1721511.904{txt}{col 55}Centered R2   = {res}  0.6608
{txt}Total (uncentered) SS   = {res} 6219227.351{txt}{col 55}Uncentered R2 = {res}  0.9061
{txt}Residual SS             = {res}  583948.633{txt}{col 55}Root MSE      = {res}      81

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_export_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-142.8161{col 35}{space 2} 60.21174{col 46}{space 1}   -2.37{col 55}{space 3}0.018{col 63}{space 4}-260.8289{col 76}{space 3}-24.80327
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0048679{col 35}{space 2}   .00324{col 46}{space 1}   -1.50{col 55}{space 3}0.133{col 63}{space 4}-.0112181{col 76}{space 3} .0014824
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-1.871696{col 35}{space 2} 8.726026{col 46}{space 1}   -0.21{col 55}{space 3}0.830{col 63}{space 4}-18.97439{col 76}{space 3}   15.231
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2} 5.773069{col 35}{space 2} 13.01006{col 46}{space 1}    0.44{col 55}{space 3}0.657{col 63}{space 4}-19.72618{col 76}{space 3} 31.27232
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.3297869{col 35}{space 2} .7280552{col 46}{space 1}   -0.45{col 55}{space 3}0.651{col 63}{space 4}-1.756749{col 76}{space 3} 1.097175
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0561352{col 35}{space 2}  .021071{col 46}{space 1}   -2.66{col 55}{space 3}0.008{col 63}{space 4}-.0974337{col 76}{space 3}-.0148367
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}  21.6946{col 35}{space 2} 5.129305{col 46}{space 1}    4.23{col 55}{space 3}0.000{col 63}{space 4} 11.64135{col 76}{space 3} 31.74786
{txt}{space 16}_cons {c |}{col 23}{res}{space 2}-194.8095{col 35}{space 2} 479.4599{col 46}{space 1}   -0.41{col 55}{space 3}0.685{col 63}{space 4}-1134.534{col 76}{space 3} 744.9145
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   6.155
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0131
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  12.186
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}lpd1500s
{hline 78}

{com}. 
. // Panel D, column 15
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=legor_uk) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6698e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      93
{txt}{col 55}F(  1,    91) = {res}   26.12
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1815122.467{txt}{col 55}Centered R2   = {res}  0.5695
{txt}Total (uncentered) SS   = {res} 6517769.499{txt}{col 55}Uncentered R2 = {res}  0.8801
{txt}Residual SS             = {res}  781464.263{txt}{col 55}Root MSE      = {res}   91.67

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_export_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-142.7509{col 32}{space 2} 27.62741{col 43}{space 1}   -5.17{col 52}{space 3}0.000{col 60}{space 4}-196.8996{col 73}{space 3}-88.60215
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 351.5863{col 32}{space 2} 31.38976{col 43}{space 1}   11.20{col 52}{space 3}0.000{col 60}{space 4} 290.0635{col 73}{space 3} 413.1091
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   2.573
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1087
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   6.176
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel D, column 16
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=legor_uk) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6698e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      93
{txt}{col 55}F(  7,    85) = {res}    0.26
{txt}{col 55}Prob > F      = {res}  0.9664
{txt}Total (centered) SS     = {res} 1815122.467{txt}{col 55}Centered R2   = {res} -8.1599
{txt}Total (uncentered) SS   = {res} 6517769.499{txt}{col 55}Uncentered R2 = {res} -1.5509
{txt}Residual SS             = {res} 16626343.29{txt}{col 55}Root MSE      = {res}   422.8

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_export_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2} 867.4124{col 35}{space 2} 3502.138{col 46}{space 1}    0.25{col 55}{space 3}0.804{col 63}{space 4}-5996.651{col 76}{space 3} 7731.476
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0551054{col 35}{space 2}  .171901{col 46}{space 1}   -0.32{col 55}{space 3}0.749{col 63}{space 4}-.3920252{col 76}{space 3} .2818144
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-92.68372{col 35}{space 2} 309.9096{col 46}{space 1}   -0.30{col 55}{space 3}0.765{col 63}{space 4}-700.0955{col 76}{space 3}  514.728
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-138.9266{col 35}{space 2} 502.9332{col 46}{space 1}   -0.28{col 55}{space 3}0.782{col 63}{space 4}-1124.658{col 76}{space 3} 846.8043
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-9.996565{col 35}{space 2} 32.66251{col 46}{space 1}   -0.31{col 55}{space 3}0.760{col 63}{space 4} -74.0139{col 76}{space 3} 54.02077
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2} .3874583{col 35}{space 2} 1.571004{col 46}{space 1}    0.25{col 55}{space 3}0.805{col 63}{space 4}-2.691653{col 76}{space 3}  3.46657
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2}-.1976233{col 35}{space 2} 93.23215{col 46}{space 1}   -0.00{col 55}{space 3}0.998{col 63}{space 4}-182.9293{col 76}{space 3}  182.534
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 6085.994{col 35}{space 2} 21797.34{col 46}{space 1}    0.28{col 55}{space 3}0.780{col 63}{space 4}   -36636{col 76}{space 3} 48807.99
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   0.057
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.8105
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   0.054
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}legor_uk
{hline 78}

{com}. 
. // Panel E, column 15
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=EngFrac EurFrac) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3074e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     136
{txt}{col 55}F(  1,   134) = {res}    6.66
{txt}{col 55}Prob > F      = {res}  0.0109
{txt}Total (centered) SS     = {res} 1693721.124{txt}{col 55}Centered R2   = {res}  0.4655
{txt}Total (uncentered) SS   = {res}  7596939.31{txt}{col 55}Uncentered R2 = {res}  0.8808
{txt}Residual SS             = {res} 905303.7757{txt}{col 55}Root MSE      = {res}   81.59

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_export_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-108.3853{col 32}{space 2} 41.67369{col 43}{space 1}   -2.60{col 52}{space 3}0.009{col 60}{space 4}-190.0642{col 73}{space 3}-26.70641
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 316.3633{col 32}{space 2} 49.43434{col 43}{space 1}    6.40{col 52}{space 3}0.000{col 60}{space 4} 219.4737{col 73}{space 3} 413.2528
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   5.099
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0781
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   2.878
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   2.392
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.1219
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel E, column 16
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=EngFrac EurFrac) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3048e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     135
{txt}{col 55}F(  7,   127) = {res}    7.96
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res}  1682306.82{txt}{col 55}Centered R2   = {res}  0.6344
{txt}Total (uncentered) SS   = {res} 7539870.622{txt}{col 55}Uncentered R2 = {res}  0.9184
{txt}Residual SS             = {res} 614993.7767{txt}{col 55}Root MSE      = {res}   67.49

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_export_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-72.90344{col 35}{space 2} 26.59274{col 46}{space 1}   -2.74{col 55}{space 3}0.006{col 63}{space 4}-125.0243{col 76}{space 3}-20.78262
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0052388{col 35}{space 2} .0012505{col 46}{space 1}   -4.19{col 55}{space 3}0.000{col 63}{space 4}-.0076897{col 76}{space 3} -.002788
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-2.645733{col 35}{space 2} 1.493652{col 46}{space 1}   -1.77{col 55}{space 3}0.077{col 63}{space 4}-5.573237{col 76}{space 3} .2817707
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-3.641449{col 35}{space 2} 3.148134{col 46}{space 1}   -1.16{col 55}{space 3}0.247{col 63}{space 4}-9.811678{col 76}{space 3} 2.528781
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.3648475{col 35}{space 2} .2108137{col 46}{space 1}   -1.73{col 55}{space 3}0.084{col 63}{space 4}-.7780347{col 76}{space 3} .0483398
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0054596{col 35}{space 2}  .014784{col 46}{space 1}   -0.37{col 55}{space 3}0.712{col 63}{space 4}-.0344358{col 76}{space 3} .0235165
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 6.279647{col 35}{space 2} 3.107296{col 46}{space 1}    2.02{col 55}{space 3}0.043{col 63}{space 4} .1894587{col 76}{space 3} 12.36984
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 366.7915{col 35}{space 2} 93.07967{col 46}{space 1}    3.94{col 55}{space 3}0.000{col 63}{space 4} 184.3587{col 76}{space 3} 549.2243
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   7.757
{txt}{col 52}Chi-sq({res}2{txt}) P-val =  {res}{col 73}0.0207
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   8.565
{txt}Stock-Yogo weak ID test critical values:{col 42}10% maximal IV size{res}{col 73} 19.93
{txt}{col 42}15% maximal IV size{res}{col 73} 11.59
{txt}{col 42}20% maximal IV size{res}{col 73}  8.75
{txt}{col 42}25% maximal IV size{res}{col 73}  7.25
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.297
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.5857
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}EngFrac EurFrac
{hline 78}

{com}. 
. // Panel F, column 15 
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3159e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     142
{txt}{col 55}F(  1,   140) = {res}   27.25
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1811142.556{txt}{col 55}Centered R2   = {res}  0.3786
{txt}Total (uncentered) SS   = {res}  8019242.82{txt}{col 55}Uncentered R2 = {res}  0.8597
{txt}Residual SS             = {res} 1125403.703{txt}{col 55}Root MSE      = {res}   89.02

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_export_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-146.0347{col 32}{space 2} 27.77862{col 43}{space 1}   -5.26{col 52}{space 3}0.000{col 60}{space 4}-200.4798{col 73}{space 3}-91.58965
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}  353.648{col 32}{space 2} 33.53731{col 43}{space 1}   10.54{col 52}{space 3}0.000{col 60}{space 4} 287.9161{col 73}{space 3}   419.38
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  19.148
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.0384
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   4.478
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   8.770
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.4588
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel F, column 16
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     3.3134e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}     141
{txt}{col 55}F(  7,   133) = {res}    9.91
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1799512.414{txt}{col 55}Centered R2   = {res}  0.6206
{txt}Total (uncentered) SS   = {res} 7961577.507{txt}{col 55}Uncentered R2 = {res}  0.9142
{txt}Residual SS             = {res} 682737.2962{txt}{col 55}Root MSE      = {res}   69.59

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_export_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-86.31775{col 35}{space 2} 33.05362{col 46}{space 1}   -2.61{col 55}{space 3}0.009{col 63}{space 4}-151.1017{col 76}{space 3}-21.53384
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0049235{col 35}{space 2} .0013471{col 46}{space 1}   -3.65{col 55}{space 3}0.000{col 63}{space 4}-.0075637{col 76}{space 3}-.0022833
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-2.366438{col 35}{space 2} 1.323065{col 46}{space 1}   -1.79{col 55}{space 3}0.074{col 63}{space 4}-4.959597{col 76}{space 3} .2267213
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-3.248317{col 35}{space 2} 2.804889{col 46}{space 1}   -1.16{col 55}{space 3}0.247{col 63}{space 4}-8.745798{col 76}{space 3} 2.249164
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.2974025{col 35}{space 2} .2389361{col 46}{space 1}   -1.24{col 55}{space 3}0.213{col 63}{space 4}-.7657086{col 76}{space 3} .1709037
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0112856{col 35}{space 2} .0200693{col 46}{space 1}   -0.56{col 55}{space 3}0.574{col 63}{space 4}-.0506207{col 76}{space 3} .0280496
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 6.650656{col 35}{space 2} 3.238281{col 46}{space 1}    2.05{col 55}{space 3}0.040{col 63}{space 4} .3037412{col 76}{space 3} 12.99757
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 339.8081{col 35}{space 2} 99.33747{col 46}{space 1}    3.42{col 55}{space 3}0.001{col 63}{space 4} 145.1102{col 76}{space 3} 534.5059
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  10.747
{txt}{col 52}Chi-sq({res}10{txt}) P-val =  {res}{col 73}0.3775
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}   1.733
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 20.74
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.49
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.61
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.86
{txt}{col 42}10% maximal IV size{res}{col 73} 38.54
{txt}{col 42}15% maximal IV size{res}{col 73} 20.88
{txt}{col 42}20% maximal IV size{res}{col 73} 14.78
{txt}{col 42}25% maximal IV size{res}{col 73} 11.65
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  12.804
{txt}{col 52}Chi-sq({res}9{txt}) P-val =  {res}{col 73}0.1717
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}bananas coffee copper maize millet rice rubber silver
{col 23}sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 15 
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  1,    71) = {res}   65.03
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1373058.882{txt}{col 55}Centered R2   = {res}  0.6003
{txt}Total (uncentered) SS   = {res} 5030872.525{txt}{col 55}Uncentered R2 = {res}  0.8909
{txt}Residual SS             = {res} 548865.6266{txt}{col 55}Root MSE      = {res}   86.71

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}mean_export_v~2019{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
democracy_vdem2000 {c |}{col 20}{res}{space 2}-137.0219{col 32}{space 2} 16.75781{col 43}{space 1}   -8.18{col 52}{space 3}0.000{col 60}{space 4}-169.8666{col 73}{space 3}-104.1772
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 347.9438{col 32}{space 2} 23.42905{col 43}{space 1}   14.85{col 52}{space 3}0.000{col 60}{space 4} 302.0238{col 73}{space 3} 393.8639
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  21.884
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.1109
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  84.236
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  10.347
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.7364
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. // Panel G, column 16
. ivreg2 mean_export_value_2001_2019 (democracy_vdem2000=logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee copper maize millet rice rubber silver sugarcane wheat) gdppc2000 ${c -(}base_covariates2000{c )-} [w=total_gdp2000], robust
{txt}(analytic weights assumed)
(sum of wgt is     1.6481e+04)

IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                   {col 55}Number of obs = {res}      73
{txt}{col 55}F(  7,    65) = {res}   67.99
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 1373058.882{txt}{col 55}Centered R2   = {res}  0.7418
{txt}Total (uncentered) SS   = {res} 5030872.525{txt}{col 55}Uncentered R2 = {res}  0.9295
{txt}Residual SS             = {res} 354524.7644{txt}{col 55}Root MSE      = {res}   69.69

{txt}{hline 22}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 23}{c |}{col 35}    Robust
{col 1}mean_export_valu~2019{col 23}{c |}      Coef.{col 35}   Std. Err.{col 47}      z{col 55}   P>|z|{col 63}     [95% Con{col 76}f. Interval]
{hline 22}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}democracy_vdem2000 {c |}{col 23}{res}{space 2}-88.76538{col 35}{space 2} 21.47229{col 46}{space 1}   -4.13{col 55}{space 3}0.000{col 63}{space 4}-130.8503{col 76}{space 3}-46.68046
{txt}{space 12}gdppc2000 {c |}{col 23}{res}{space 2}-.0073764{col 35}{space 2} .0014685{col 46}{space 1}   -5.02{col 55}{space 3}0.000{col 63}{space 4}-.0102546{col 76}{space 3}-.0044982
{txt}{space 14}abs_lat {c |}{col 23}{res}{space 2}-6.715019{col 35}{space 2} 3.936525{col 46}{space 1}   -1.71{col 55}{space 3}0.088{col 63}{space 4}-14.43047{col 76}{space 3} 1.000429
{txt}{space 2}mean_temp_1991_2000 {c |}{col 23}{res}{space 2}-2.051699{col 35}{space 2} 5.298604{col 46}{space 1}   -0.39{col 55}{space 3}0.699{col 63}{space 4}-12.43677{col 76}{space 3} 8.333374
{txt}mean_precip_1991_2000 {c |}{col 23}{res}{space 2}-.8874939{col 35}{space 2} .4710903{col 46}{space 1}   -1.88{col 55}{space 3}0.060{col 63}{space 4}-1.810814{col 76}{space 3} .0358261
{txt}{space 6}pop_density2000 {c |}{col 23}{res}{space 2}-.0310537{col 35}{space 2} .0216556{col 46}{space 1}   -1.43{col 55}{space 3}0.152{col 63}{space 4} -.073498{col 76}{space 3} .0113906
{txt}{space 7}median_age2000 {c |}{col 23}{res}{space 2} 19.61845{col 35}{space 2} 5.232467{col 46}{space 1}    3.75{col 55}{space 3}0.000{col 63}{space 4} 9.363008{col 76}{space 3}  29.8739
{txt}{space 16}_cons {c |}{col 23}{res}{space 2} 169.1245{col 35}{space 2}  224.782{col 46}{space 1}    0.75{col 55}{space 3}0.452{col 63}{space 4}-271.4402{col 76}{space 3} 609.6892
{txt}{hline 22}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  15.411
{txt}{col 52}Chi-sq({res}15{txt}) P-val =  {res}{col 73}0.4222
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  14.207
{txt}Stock-Yogo weak ID test critical values:{col 43}5% maximal IV relative bias{res}{col 73} 21.23
{txt}{col 42}10% maximal IV relative bias{res}{col 73} 11.51
{txt}{col 42}20% maximal IV relative bias{res}{col 73}  6.42
{txt}{col 42}30% maximal IV relative bias{res}{col 73}  4.63
{txt}{col 42}10% maximal IV size{res}{col 73} 50.39
{txt}{col 42}15% maximal IV size{res}{col 73} 26.80
{txt}{col 42}20% maximal IV size{res}{col 73} 18.72
{txt}{col 42}25% maximal IV size{res}{col 73} 14.60
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}  17.947
{txt}{col 52}Chi-sq({res}14{txt}) P-val =  {res}{col 73}0.2092
{txt}{hline 78}
Instrumented:{col 23}democracy_vdem2000
Included instruments:{col 23}gdppc2000 abs_lat mean_temp_1991_2000
{col 23}mean_precip_1991_2000 pop_density2000 median_age2000
Excluded instruments:{col 23}logem4 lpd1500s legor_uk EngFrac EurFrac bananas coffee
{col 23}copper maize millet rice rubber silver sugarcane wheat
{hline 78}

{com}. 
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/ayumis/Dropbox/Democracy/MainAnalysis/code/2_analyze/tables/main/logs/table3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}21 Sep 2021, 18:46:47
{txt}{.-}
{smcl}
{txt}{sf}{ul off}